remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/aon_gp_regs.h
/**
 * \file
 *
 * \brief Component description for AON_GP_REGS
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMB11_AON_GP_REGS_COMPONENT_
#define _SAMB11_AON_GP_REGS_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR AON_GP_REGS */
/* ========================================================================== */
/** \addtogroup SAMB11_AON_GP_REGS Always On General Purpose Registers 
 *  @{
 */

#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'N'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO*/
#endif

#define AON_GP_REGS_AGR1234
#define REV_AON_GP_REGS                  0x100

/* -------- AON_GP_REGS_AON_PINMUX_SEL : (AON_GP_REGS Offset: 0x00) (R/W 16) Controls the pinmux selection for the AO GPIOs -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t AO_GPIO_0_SEL:2;           /**< bit:   0..1  Pinmux select for AO_GPIO_0              */
    uint16_t :2;                        /**< bit:   2..3  Reserved */
    uint16_t AO_GPIO_1_SEL:2;           /**< bit:   4..5  Pinmux select for AO_GPIO_1              */
    uint16_t :2;                        /**< bit:   6..7  Reserved */
    uint16_t AO_GPIO_2_SEL:2;           /**< bit:   8..9  Pinmux select for AO_GPIO_2              */
    uint16_t :6;                        /**< bit: 10..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} AON_GP_REGS_AON_PINMUX_SEL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_GP_REGS_AON_PINMUX_SEL_OFFSET   0x00                                          /**<  (AON_GP_REGS_AON_PINMUX_SEL) Controls the pinmux selection for the AO GPIOs  Offset */
#define AON_GP_REGS_AON_PINMUX_SEL_RESETVALUE 0x01u                                         /**<  (AON_GP_REGS_AON_PINMUX_SEL) Controls the pinmux selection for the AO GPIOs  Reset Value */

#define AON_GP_REGS_AON_PINMUX_SEL_AO_GPIO_0_SEL_Pos 0                                              /**< (AON_GP_REGS_AON_PINMUX_SEL) Pinmux select for AO_GPIO_0 Position */
#define AON_GP_REGS_AON_PINMUX_SEL_AO_GPIO_0_SEL_Msk (0x3u << AON_GP_REGS_AON_PINMUX_SEL_AO_GPIO_0_SEL_Pos)  /**< (AON_GP_REGS_AON_PINMUX_SEL) Pinmux select for AO_GPIO_0 Mask */
#define AON_GP_REGS_AON_PINMUX_SEL_AO_GPIO_0_SEL(value) (AON_GP_REGS_AON_PINMUX_SEL_AO_GPIO_0_SEL_Msk & ((value) << AON_GP_REGS_AON_PINMUX_SEL_AO_GPIO_0_SEL_Pos))
#define AON_GP_REGS_AON_PINMUX_SEL_AO_GPIO_1_SEL_Pos 4                                              /**< (AON_GP_REGS_AON_PINMUX_SEL) Pinmux select for AO_GPIO_1 Position */
#define AON_GP_REGS_AON_PINMUX_SEL_AO_GPIO_1_SEL_Msk (0x3u << AON_GP_REGS_AON_PINMUX_SEL_AO_GPIO_1_SEL_Pos)  /**< (AON_GP_REGS_AON_PINMUX_SEL) Pinmux select for AO_GPIO_1 Mask */
#define AON_GP_REGS_AON_PINMUX_SEL_AO_GPIO_1_SEL(value) (AON_GP_REGS_AON_PINMUX_SEL_AO_GPIO_1_SEL_Msk & ((value) << AON_GP_REGS_AON_PINMUX_SEL_AO_GPIO_1_SEL_Pos))
#define AON_GP_REGS_AON_PINMUX_SEL_AO_GPIO_2_SEL_Pos 8                                              /**< (AON_GP_REGS_AON_PINMUX_SEL) Pinmux select for AO_GPIO_2 Position */
#define AON_GP_REGS_AON_PINMUX_SEL_AO_GPIO_2_SEL_Msk (0x3u << AON_GP_REGS_AON_PINMUX_SEL_AO_GPIO_2_SEL_Pos)  /**< (AON_GP_REGS_AON_PINMUX_SEL) Pinmux select for AO_GPIO_2 Mask */
#define AON_GP_REGS_AON_PINMUX_SEL_AO_GPIO_2_SEL(value) (AON_GP_REGS_AON_PINMUX_SEL_AO_GPIO_2_SEL_Msk & ((value) << AON_GP_REGS_AON_PINMUX_SEL_AO_GPIO_2_SEL_Pos))
#define AON_GP_REGS_AON_PINMUX_SEL_MASK     0x333u                                         /**< \deprecated (AON_GP_REGS_AON_PINMUX_SEL) Register MASK  (Use AON_GP_REGS_AON_PINMUX_SEL_Msk instead)  */
#define AON_GP_REGS_AON_PINMUX_SEL_Msk      0x333u                                         /**< (AON_GP_REGS_AON_PINMUX_SEL) Register Mask  */

/* -------- AON_GP_REGS_AON_PMU_CTRL : (AON_GP_REGS Offset: 0x04) (R/W 32) Always On Misc Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t PMU_REGS_4TO1_SEL:1;       /**< bit:      0  If 1 then uses the frequency hopping table otherwise registers in PD0 */
    uint32_t PMU_RTC_CLK_EN:1;          /**< bit:      1  Enables the PMU RTC clock                */
    uint32_t :2;                        /**< bit:   2..3  Reserved */
    uint32_t PMU_RETN_VAL_SEL:2;        /**< bit:   4..5  Retention Voltage Selection              */
    uint32_t :1;                        /**< bit:      6  Reserved */
    uint32_t EFUSE_LDO_EN:1;            /**< bit:      7  Enables the EFUSE LDO                    */
    uint32_t PMU_MUX_EN:1;              /**< bit:      8  PMU MUX EN                               */
    uint32_t PMU_MUX_A:3;               /**< bit:  9..11  PMU MUX A                                */
    uint32_t PMU_MUX_SEL:4;             /**< bit: 12..15  PMU MUX SEL                              */
    uint32_t PMU_SENS_ADC_EN:1;         /**< bit:     16  PMU Sensor ADC Enable                    */
    uint32_t PMU_SENS_ADC_RST:1;        /**< bit:     17  PMU Sensor ADC Reset                     */
    uint32_t PMU_BGR_EN:1;              /**< bit:     18  PMU BGR EN                               */
    uint32_t PMU_2MHZ_CLK_EN:1;         /**< bit:     19  Enables the 2MHz OSC clock coming to the digital from the PMU */
    uint32_t PMU_26MHZ_CLK_FORCE_OFF:1;  /**< bit:     20  If set, this will force off the OSC 26 MHz clock, otherwise this will follow the power for PD1 */
    uint32_t :11;                       /**< bit: 21..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AON_GP_REGS_AON_PMU_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_GP_REGS_AON_PMU_CTRL_OFFSET     0x04                                          /**<  (AON_GP_REGS_AON_PMU_CTRL) Always On Misc Control  Offset */
#define AON_GP_REGS_AON_PMU_CTRL_RESETVALUE 0xA0022u                                      /**<  (AON_GP_REGS_AON_PMU_CTRL) Always On Misc Control  Reset Value */

