remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/aon_gp_regs.h
#define AON_GP_REGS_AON_PMU_CTRL_PMU_REGS_4TO1_SEL_Pos 0                                              /**< (AON_GP_REGS_AON_PMU_CTRL) If 1 then uses the frequency hopping table otherwise registers in PD0 Position */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_REGS_4TO1_SEL_Msk (0x1u << AON_GP_REGS_AON_PMU_CTRL_PMU_REGS_4TO1_SEL_Pos)  /**< (AON_GP_REGS_AON_PMU_CTRL) If 1 then uses the frequency hopping table otherwise registers in PD0 Mask */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_REGS_4TO1_SEL AON_GP_REGS_AON_PMU_CTRL_PMU_REGS_4TO1_SEL_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_PMU_CTRL_PMU_REGS_4TO1_SEL_Msk instead */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_RTC_CLK_EN_Pos 1                                              /**< (AON_GP_REGS_AON_PMU_CTRL) Enables the PMU RTC clock Position */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_RTC_CLK_EN_Msk (0x1u << AON_GP_REGS_AON_PMU_CTRL_PMU_RTC_CLK_EN_Pos)  /**< (AON_GP_REGS_AON_PMU_CTRL) Enables the PMU RTC clock Mask */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_RTC_CLK_EN AON_GP_REGS_AON_PMU_CTRL_PMU_RTC_CLK_EN_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_PMU_CTRL_PMU_RTC_CLK_EN_Msk instead */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_RETN_VAL_SEL_Pos 4                                              /**< (AON_GP_REGS_AON_PMU_CTRL) Retention Voltage Selection Position */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_RETN_VAL_SEL_Msk (0x3u << AON_GP_REGS_AON_PMU_CTRL_PMU_RETN_VAL_SEL_Pos)  /**< (AON_GP_REGS_AON_PMU_CTRL) Retention Voltage Selection Mask */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_RETN_VAL_SEL(value) (AON_GP_REGS_AON_PMU_CTRL_PMU_RETN_VAL_SEL_Msk & ((value) << AON_GP_REGS_AON_PMU_CTRL_PMU_RETN_VAL_SEL_Pos))
#define AON_GP_REGS_AON_PMU_CTRL_EFUSE_LDO_EN_Pos 7                                              /**< (AON_GP_REGS_AON_PMU_CTRL) Enables the EFUSE LDO Position */
#define AON_GP_REGS_AON_PMU_CTRL_EFUSE_LDO_EN_Msk (0x1u << AON_GP_REGS_AON_PMU_CTRL_EFUSE_LDO_EN_Pos)  /**< (AON_GP_REGS_AON_PMU_CTRL) Enables the EFUSE LDO Mask */
#define AON_GP_REGS_AON_PMU_CTRL_EFUSE_LDO_EN AON_GP_REGS_AON_PMU_CTRL_EFUSE_LDO_EN_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_PMU_CTRL_EFUSE_LDO_EN_Msk instead */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_MUX_EN_Pos 8                                              /**< (AON_GP_REGS_AON_PMU_CTRL) PMU MUX EN Position */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_MUX_EN_Msk (0x1u << AON_GP_REGS_AON_PMU_CTRL_PMU_MUX_EN_Pos)  /**< (AON_GP_REGS_AON_PMU_CTRL) PMU MUX EN Mask */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_MUX_EN AON_GP_REGS_AON_PMU_CTRL_PMU_MUX_EN_Msk        /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_PMU_CTRL_PMU_MUX_EN_Msk instead */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_MUX_A_Pos 9                                              /**< (AON_GP_REGS_AON_PMU_CTRL) PMU MUX A Position */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_MUX_A_Msk (0x7u << AON_GP_REGS_AON_PMU_CTRL_PMU_MUX_A_Pos)  /**< (AON_GP_REGS_AON_PMU_CTRL) PMU MUX A Mask */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_MUX_A(value) (AON_GP_REGS_AON_PMU_CTRL_PMU_MUX_A_Msk & ((value) << AON_GP_REGS_AON_PMU_CTRL_PMU_MUX_A_Pos))
#define AON_GP_REGS_AON_PMU_CTRL_PMU_MUX_SEL_Pos 12                                             /**< (AON_GP_REGS_AON_PMU_CTRL) PMU MUX SEL Position */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_MUX_SEL_Msk (0xFu << AON_GP_REGS_AON_PMU_CTRL_PMU_MUX_SEL_Pos)  /**< (AON_GP_REGS_AON_PMU_CTRL) PMU MUX SEL Mask */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_MUX_SEL(value) (AON_GP_REGS_AON_PMU_CTRL_PMU_MUX_SEL_Msk & ((value) << AON_GP_REGS_AON_PMU_CTRL_PMU_MUX_SEL_Pos))
#define AON_GP_REGS_AON_PMU_CTRL_PMU_SENS_ADC_EN_Pos 16                                             /**< (AON_GP_REGS_AON_PMU_CTRL) PMU Sensor ADC Enable Position */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_SENS_ADC_EN_Msk (0x1u << AON_GP_REGS_AON_PMU_CTRL_PMU_SENS_ADC_EN_Pos)  /**< (AON_GP_REGS_AON_PMU_CTRL) PMU Sensor ADC Enable Mask */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_SENS_ADC_EN AON_GP_REGS_AON_PMU_CTRL_PMU_SENS_ADC_EN_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_PMU_CTRL_PMU_SENS_ADC_EN_Msk instead */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_SENS_ADC_RST_Pos 17                                             /**< (AON_GP_REGS_AON_PMU_CTRL) PMU Sensor ADC Reset Position */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_SENS_ADC_RST_Msk (0x1u << AON_GP_REGS_AON_PMU_CTRL_PMU_SENS_ADC_RST_Pos)  /**< (AON_GP_REGS_AON_PMU_CTRL) PMU Sensor ADC Reset Mask */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_SENS_ADC_RST AON_GP_REGS_AON_PMU_CTRL_PMU_SENS_ADC_RST_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_PMU_CTRL_PMU_SENS_ADC_RST_Msk instead */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_BGR_EN_Pos 18                                             /**< (AON_GP_REGS_AON_PMU_CTRL) PMU BGR EN Position */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_BGR_EN_Msk (0x1u << AON_GP_REGS_AON_PMU_CTRL_PMU_BGR_EN_Pos)  /**< (AON_GP_REGS_AON_PMU_CTRL) PMU BGR EN Mask */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_BGR_EN AON_GP_REGS_AON_PMU_CTRL_PMU_BGR_EN_Msk        /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_PMU_CTRL_PMU_BGR_EN_Msk instead */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_2MHZ_CLK_EN_Pos 19                                             /**< (AON_GP_REGS_AON_PMU_CTRL) Enables the 2MHz OSC clock coming to the digital from the PMU Position */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_2MHZ_CLK_EN_Msk (0x1u << AON_GP_REGS_AON_PMU_CTRL_PMU_2MHZ_CLK_EN_Pos)  /**< (AON_GP_REGS_AON_PMU_CTRL) Enables the 2MHz OSC clock coming to the digital from the PMU Mask */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_2MHZ_CLK_EN AON_GP_REGS_AON_PMU_CTRL_PMU_2MHZ_CLK_EN_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_PMU_CTRL_PMU_2MHZ_CLK_EN_Msk instead */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_26MHZ_CLK_FORCE_OFF_Pos 20                                             /**< (AON_GP_REGS_AON_PMU_CTRL) If set, this will force off the OSC 26 MHz clock, otherwise this will follow the power for PD1 Position */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_26MHZ_CLK_FORCE_OFF_Msk (0x1u << AON_GP_REGS_AON_PMU_CTRL_PMU_26MHZ_CLK_FORCE_OFF_Pos)  /**< (AON_GP_REGS_AON_PMU_CTRL) If set, this will force off the OSC 26 MHz clock, otherwise this will follow the power for PD1 Mask */
#define AON_GP_REGS_AON_PMU_CTRL_PMU_26MHZ_CLK_FORCE_OFF AON_GP_REGS_AON_PMU_CTRL_PMU_26MHZ_CLK_FORCE_OFF_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_PMU_CTRL_PMU_26MHZ_CLK_FORCE_OFF_Msk instead */
#define AON_GP_REGS_AON_PMU_CTRL_MASK       0x1FFFB3u                                      /**< \deprecated (AON_GP_REGS_AON_PMU_CTRL) Register MASK  (Use AON_GP_REGS_AON_PMU_CTRL_Msk instead)  */
#define AON_GP_REGS_AON_PMU_CTRL_Msk        0x1FFFB3u                                      /**< (AON_GP_REGS_AON_PMU_CTRL) Register Mask  */

