remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/aon_gp_regs.h
/* -------- AON_GP_REGS_AON_BLE_LP_CTRL : (AON_GP_REGS Offset: 0x08) (R/W 8) Always On BLE LP Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  WAKEUP_LP_LATCH:1;         /**< bit:      0  If set, this will latch the wakeup signal in the BLE LP block */
    uint8_t  DEEP_SLEEP_STAT_SYNC_EN:1;  /**< bit:      1  If set, this will use the sync flops for deep sleep stat */
    uint8_t  :6;                        /**< bit:   2..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} AON_GP_REGS_AON_BLE_LP_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_GP_REGS_AON_BLE_LP_CTRL_OFFSET  0x08                                          /**<  (AON_GP_REGS_AON_BLE_LP_CTRL) Always On BLE LP Control  Offset */
#define AON_GP_REGS_AON_BLE_LP_CTRL_RESETVALUE 0x00u                                         /**<  (AON_GP_REGS_AON_BLE_LP_CTRL) Always On BLE LP Control  Reset Value */

#define AON_GP_REGS_AON_BLE_LP_CTRL_WAKEUP_LP_LATCH_Pos 0                                              /**< (AON_GP_REGS_AON_BLE_LP_CTRL) If set, this will latch the wakeup signal in the BLE LP block Position */
#define AON_GP_REGS_AON_BLE_LP_CTRL_WAKEUP_LP_LATCH_Msk (0x1u << AON_GP_REGS_AON_BLE_LP_CTRL_WAKEUP_LP_LATCH_Pos)  /**< (AON_GP_REGS_AON_BLE_LP_CTRL) If set, this will latch the wakeup signal in the BLE LP block Mask */
#define AON_GP_REGS_AON_BLE_LP_CTRL_WAKEUP_LP_LATCH AON_GP_REGS_AON_BLE_LP_CTRL_WAKEUP_LP_LATCH_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_BLE_LP_CTRL_WAKEUP_LP_LATCH_Msk instead */
#define AON_GP_REGS_AON_BLE_LP_CTRL_DEEP_SLEEP_STAT_SYNC_EN_Pos 1                                              /**< (AON_GP_REGS_AON_BLE_LP_CTRL) If set, this will use the sync flops for deep sleep stat Position */
#define AON_GP_REGS_AON_BLE_LP_CTRL_DEEP_SLEEP_STAT_SYNC_EN_Msk (0x1u << AON_GP_REGS_AON_BLE_LP_CTRL_DEEP_SLEEP_STAT_SYNC_EN_Pos)  /**< (AON_GP_REGS_AON_BLE_LP_CTRL) If set, this will use the sync flops for deep sleep stat Mask */
#define AON_GP_REGS_AON_BLE_LP_CTRL_DEEP_SLEEP_STAT_SYNC_EN AON_GP_REGS_AON_BLE_LP_CTRL_DEEP_SLEEP_STAT_SYNC_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_BLE_LP_CTRL_DEEP_SLEEP_STAT_SYNC_EN_Msk instead */
#define AON_GP_REGS_AON_BLE_LP_CTRL_MASK    0x03u                                          /**< \deprecated (AON_GP_REGS_AON_BLE_LP_CTRL) Register MASK  (Use AON_GP_REGS_AON_BLE_LP_CTRL_Msk instead)  */
#define AON_GP_REGS_AON_BLE_LP_CTRL_Msk     0x03u                                          /**< (AON_GP_REGS_AON_BLE_LP_CTRL) Register Mask  */

/* -------- AON_GP_REGS_AON_MISC_CTRL : (AON_GP_REGS Offset: 0x0c) (R/W 32) Always On Misc Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :1;                        /**< bit:      0  Reserved */
    uint32_t USE_RTC_32KHZ_CLK_SLEEP_TIMER:1;  /**< bit:      1  If set, this will use the RTC version of the 32khz clock for the sleep timer */
    uint32_t USE_EXT_32KHZ_CLK_SLEEP_TIMER:1;  /**< bit:      2  If set, this will use an external RTC for the 32khz clock for the sleep timer */
    uint32_t LPMCU_BOOT_RESET_MUXSEL:1;  /**< bit:      3  If 1, then it uses the CPU register bit, otherwise LP_BOOT_PIN is connected */
    uint32_t LPMCU_USE_BOOT_REGS:1;     /**< bit:      4  If 1, then the ARM will use the boot regs instead of the boot rom for the first 4 boot addresses (0x0 - 0xF) */
    uint32_t LPMCU_CPU_RESET_OVERRIDE_EN:1;  /**< bit:      5  If 1, then it will use the PD0 register value for LPMCU CPU RESET (higher priority than lpmcu_boot_reset_muxsel) */
    uint32_t LPMCU_CPU_RESET_OVERRIDE_VAL:1;  /**< bit:      6  If lpmcu_cpu_reset_override_en is set then this value will be used for the LPMCU CPU RESET */
    uint32_t :7;                        /**< bit:  7..13  Reserved */
    uint32_t USE_2M_AON_PWR_SEQ_CLK:1;  /**< bit:     14  If set, this will use either the osc 2M or rtc 32kHz clock for the AON power sequencer.  The field use_rtc_aon_pwr_seq_clk determines which. */
    uint32_t USE_OSC2M_AS_TB_CLK:1;     /**< bit:     15  If set, this will use the osc 2M clock as the PD0 testbus clock */
    uint32_t AON_SLEEP_TIMER_CLK_EN:1;  /**< bit:     16  If set, this will enable the 32khz clock to the AON Sleep Timer */
    uint32_t AON_EXT_32KHZ_OUT_EN:1;    /**< bit:     17  If set, this will enable the 32khz clock to the AON pads as an output of the chip */
    uint32_t USE_RTC_AON_PWR_SEQ_CLK:1;  /**< bit:     18  If set, this will use the RTC clock as the AON power sequencer clock once use_2m_aon_pwr_seq_clk is also set.  This must be set first. */
    uint32_t INVERT_WAKEUP_GPIO_0:1;    /**< bit:     19  If set, this will invert the wakeup gpio_0 */
    uint32_t FORCE_OFF_XO:1;            /**< bit:     20  If set, this will force off the XO, otherwise XO is always on if BLE core is powered on. */
    uint32_t FORCE_XO_TO_BYPASS_MODE:1;  /**< bit:     21  If set, this will force the XO into bypass mode. */
    uint32_t :10;                       /**< bit: 22..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AON_GP_REGS_AON_MISC_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_GP_REGS_AON_MISC_CTRL_OFFSET    0x0C                                          /**<  (AON_GP_REGS_AON_MISC_CTRL) Always On Misc Control  Offset */
#define AON_GP_REGS_AON_MISC_CTRL_RESETVALUE 0x10000u                                      /**<  (AON_GP_REGS_AON_MISC_CTRL) Always On Misc Control  Reset Value */

#define AON_GP_REGS_AON_MISC_CTRL_USE_RTC_32KHZ_CLK_SLEEP_TIMER_Pos 1                                              /**< (AON_GP_REGS_AON_MISC_CTRL) If set, this will use the RTC version of the 32khz clock for the sleep timer Position */
#define AON_GP_REGS_AON_MISC_CTRL_USE_RTC_32KHZ_CLK_SLEEP_TIMER_Msk (0x1u << AON_GP_REGS_AON_MISC_CTRL_USE_RTC_32KHZ_CLK_SLEEP_TIMER_Pos)  /**< (AON_GP_REGS_AON_MISC_CTRL) If set, this will use the RTC version of the 32khz clock for the sleep timer Mask */
#define AON_GP_REGS_AON_MISC_CTRL_USE_RTC_32KHZ_CLK_SLEEP_TIMER AON_GP_REGS_AON_MISC_CTRL_USE_RTC_32KHZ_CLK_SLEEP_TIMER_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_MISC_CTRL_USE_RTC_32KHZ_CLK_SLEEP_TIMER_Msk instead */
#define AON_GP_REGS_AON_MISC_CTRL_USE_EXT_32KHZ_CLK_SLEEP_TIMER_Pos 2                                              /**< (AON_GP_REGS_AON_MISC_CTRL) If set, this will use an external RTC for the 32khz clock for the sleep timer Position */
#define AON_GP_REGS_AON_MISC_CTRL_USE_EXT_32KHZ_CLK_SLEEP_TIMER_Msk (0x1u << AON_GP_REGS_AON_MISC_CTRL_USE_EXT_32KHZ_CLK_SLEEP_TIMER_Pos)  /**< (AON_GP_REGS_AON_MISC_CTRL) If set, this will use an external RTC for the 32khz clock for the sleep timer Mask */
#define AON_GP_REGS_AON_MISC_CTRL_USE_EXT_32KHZ_CLK_SLEEP_TIMER AON_GP_REGS_AON_MISC_CTRL_USE_EXT_32KHZ_CLK_SLEEP_TIMER_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_MISC_CTRL_USE_EXT_32KHZ_CLK_SLEEP_TIMER_Msk instead */
#define AON_GP_REGS_AON_MISC_CTRL_LPMCU_BOOT_RESET_MUXSEL_Pos 3                                              /**< (AON_GP_REGS_AON_MISC_CTRL) If 1, then it uses the CPU register bit, otherwise LP_BOOT_PIN is connected Position */
#define AON_GP_REGS_AON_MISC_CTRL_LPMCU_BOOT_RESET_MUXSEL_Msk (0x1u << AON_GP_REGS_AON_MISC_CTRL_LPMCU_BOOT_RESET_MUXSEL_Pos)  /**< (AON_GP_REGS_AON_MISC_CTRL) If 1, then it uses the CPU register bit, otherwise LP_BOOT_PIN is connected Mask */
#define AON_GP_REGS_AON_MISC_CTRL_LPMCU_BOOT_RESET_MUXSEL AON_GP_REGS_AON_MISC_CTRL_LPMCU_BOOT_RESET_MUXSEL_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_MISC_CTRL_LPMCU_BOOT_RESET_MUXSEL_Msk instead */
#define AON_GP_REGS_AON_MISC_CTRL_LPMCU_USE_BOOT_REGS_Pos 4                                              /**< (AON_GP_REGS_AON_MISC_CTRL) If 1, then the ARM will use the boot regs instead of the boot rom for the first 4 boot addresses (0x0 - 0xF) Position */
#define AON_GP_REGS_AON_MISC_CTRL_LPMCU_USE_BOOT_REGS_Msk (0x1u << AON_GP_REGS_AON_MISC_CTRL_LPMCU_USE_BOOT_REGS_Pos)  /**< (AON_GP_REGS_AON_MISC_CTRL) If 1, then the ARM will use the boot regs instead of the boot rom for the first 4 boot addresses (0x0 - 0xF) Mask */
#define AON_GP_REGS_AON_MISC_CTRL_LPMCU_USE_BOOT_REGS AON_GP_REGS_AON_MISC_CTRL_LPMCU_USE_BOOT_REGS_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_MISC_CTRL_LPMCU_USE_BOOT_REGS_Msk instead */
#define AON_GP_REGS_AON_MISC_CTRL_LPMCU_CPU_RESET_OVERRIDE_EN_Pos 5                                              /**< (AON_GP_REGS_AON_MISC_CTRL) If 1, then it will use the PD0 register value for LPMCU CPU RESET (higher priority than lpmcu_boot_reset_muxsel) Position */
#define AON_GP_REGS_AON_MISC_CTRL_LPMCU_CPU_RESET_OVERRIDE_EN_Msk (0x1u << AON_GP_REGS_AON_MISC_CTRL_LPMCU_CPU_RESET_OVERRIDE_EN_Pos)  /**< (AON_GP_REGS_AON_MISC_CTRL) If 1, then it will use the PD0 register value for LPMCU CPU RESET (higher priority than lpmcu_boot_reset_muxsel) Mask */
#define AON_GP_REGS_AON_MISC_CTRL_LPMCU_CPU_RESET_OVERRIDE_EN AON_GP_REGS_AON_MISC_CTRL_LPMCU_CPU_RESET_OVERRIDE_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_MISC_CTRL_LPMCU_CPU_RESET_OVERRIDE_EN_Msk instead */
#define AON_GP_REGS_AON_MISC_CTRL_LPMCU_CPU_RESET_OVERRIDE_VAL_Pos 6                                              /**< (AON_GP_REGS_AON_MISC_CTRL) If lpmcu_cpu_reset_override_en is set then this value will be used for the LPMCU CPU RESET Position */
#define AON_GP_REGS_AON_MISC_CTRL_LPMCU_CPU_RESET_OVERRIDE_VAL_Msk (0x1u << AON_GP_REGS_AON_MISC_CTRL_LPMCU_CPU_RESET_OVERRIDE_VAL_Pos)  /**< (AON_GP_REGS_AON_MISC_CTRL) If lpmcu_cpu_reset_override_en is set then this value will be used for the LPMCU CPU RESET Mask */
#define AON_GP_REGS_AON_MISC_CTRL_LPMCU_CPU_RESET_OVERRIDE_VAL AON_GP_REGS_AON_MISC_CTRL_LPMCU_CPU_RESET_OVERRIDE_VAL_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_MISC_CTRL_LPMCU_CPU_RESET_OVERRIDE_VAL_Msk instead */
#define AON_GP_REGS_AON_MISC_CTRL_USE_2M_AON_PWR_SEQ_CLK_Pos 14                                             /**< (AON_GP_REGS_AON_MISC_CTRL) If set, this will use either the osc 2M or rtc 32kHz clock for the AON power sequencer.  The field use_rtc_aon_pwr_seq_clk determines which. Position */
#define AON_GP_REGS_AON_MISC_CTRL_USE_2M_AON_PWR_SEQ_CLK_Msk (0x1u << AON_GP_REGS_AON_MISC_CTRL_USE_2M_AON_PWR_SEQ_CLK_Pos)  /**< (AON_GP_REGS_AON_MISC_CTRL) If set, this will use either the osc 2M or rtc 32kHz clock for the AON power sequencer.  The field use_rtc_aon_pwr_seq_clk determines which. Mask */
#define AON_GP_REGS_AON_MISC_CTRL_USE_2M_AON_PWR_SEQ_CLK AON_GP_REGS_AON_MISC_CTRL_USE_2M_AON_PWR_SEQ_CLK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_MISC_CTRL_USE_2M_AON_PWR_SEQ_CLK_Msk instead */
#define AON_GP_REGS_AON_MISC_CTRL_USE_OSC2M_AS_TB_CLK_Pos 15                                             /**< (AON_GP_REGS_AON_MISC_CTRL) If set, this will use the osc 2M clock as the PD0 testbus clock Position */
#define AON_GP_REGS_AON_MISC_CTRL_USE_OSC2M_AS_TB_CLK_Msk (0x1u << AON_GP_REGS_AON_MISC_CTRL_USE_OSC2M_AS_TB_CLK_Pos)  /**< (AON_GP_REGS_AON_MISC_CTRL) If set, this will use the osc 2M clock as the PD0 testbus clock Mask */
#define AON_GP_REGS_AON_MISC_CTRL_USE_OSC2M_AS_TB_CLK AON_GP_REGS_AON_MISC_CTRL_USE_OSC2M_AS_TB_CLK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_MISC_CTRL_USE_OSC2M_AS_TB_CLK_Msk instead */
#define AON_GP_REGS_AON_MISC_CTRL_AON_SLEEP_TIMER_CLK_EN_Pos 16                                             /**< (AON_GP_REGS_AON_MISC_CTRL) If set, this will enable the 32khz clock to the AON Sleep Timer Position */
#define AON_GP_REGS_AON_MISC_CTRL_AON_SLEEP_TIMER_CLK_EN_Msk (0x1u << AON_GP_REGS_AON_MISC_CTRL_AON_SLEEP_TIMER_CLK_EN_Pos)  /**< (AON_GP_REGS_AON_MISC_CTRL) If set, this will enable the 32khz clock to the AON Sleep Timer Mask */
#define AON_GP_REGS_AON_MISC_CTRL_AON_SLEEP_TIMER_CLK_EN AON_GP_REGS_AON_MISC_CTRL_AON_SLEEP_TIMER_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_MISC_CTRL_AON_SLEEP_TIMER_CLK_EN_Msk instead */
#define AON_GP_REGS_AON_MISC_CTRL_AON_EXT_32KHZ_OUT_EN_Pos 17                                             /**< (AON_GP_REGS_AON_MISC_CTRL) If set, this will enable the 32khz clock to the AON pads as an output of the chip Position */
#define AON_GP_REGS_AON_MISC_CTRL_AON_EXT_32KHZ_OUT_EN_Msk (0x1u << AON_GP_REGS_AON_MISC_CTRL_AON_EXT_32KHZ_OUT_EN_Pos)  /**< (AON_GP_REGS_AON_MISC_CTRL) If set, this will enable the 32khz clock to the AON pads as an output of the chip Mask */
#define AON_GP_REGS_AON_MISC_CTRL_AON_EXT_32KHZ_OUT_EN AON_GP_REGS_AON_MISC_CTRL_AON_EXT_32KHZ_OUT_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_MISC_CTRL_AON_EXT_32KHZ_OUT_EN_Msk instead */
#define AON_GP_REGS_AON_MISC_CTRL_USE_RTC_AON_PWR_SEQ_CLK_Pos 18                                             /**< (AON_GP_REGS_AON_MISC_CTRL) If set, this will use the RTC clock as the AON power sequencer clock once use_2m_aon_pwr_seq_clk is also set.  This must be set first. Position */
#define AON_GP_REGS_AON_MISC_CTRL_USE_RTC_AON_PWR_SEQ_CLK_Msk (0x1u << AON_GP_REGS_AON_MISC_CTRL_USE_RTC_AON_PWR_SEQ_CLK_Pos)  /**< (AON_GP_REGS_AON_MISC_CTRL) If set, this will use the RTC clock as the AON power sequencer clock once use_2m_aon_pwr_seq_clk is also set.  This must be set first. Mask */
#define AON_GP_REGS_AON_MISC_CTRL_USE_RTC_AON_PWR_SEQ_CLK AON_GP_REGS_AON_MISC_CTRL_USE_RTC_AON_PWR_SEQ_CLK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_MISC_CTRL_USE_RTC_AON_PWR_SEQ_CLK_Msk instead */
#define AON_GP_REGS_AON_MISC_CTRL_INVERT_WAKEUP_GPIO_0_Pos 19                                             /**< (AON_GP_REGS_AON_MISC_CTRL) If set, this will invert the wakeup gpio_0 Position */
#define AON_GP_REGS_AON_MISC_CTRL_INVERT_WAKEUP_GPIO_0_Msk (0x1u << AON_GP_REGS_AON_MISC_CTRL_INVERT_WAKEUP_GPIO_0_Pos)  /**< (AON_GP_REGS_AON_MISC_CTRL) If set, this will invert the wakeup gpio_0 Mask */
#define AON_GP_REGS_AON_MISC_CTRL_INVERT_WAKEUP_GPIO_0 AON_GP_REGS_AON_MISC_CTRL_INVERT_WAKEUP_GPIO_0_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_MISC_CTRL_INVERT_WAKEUP_GPIO_0_Msk instead */
#define AON_GP_REGS_AON_MISC_CTRL_FORCE_OFF_XO_Pos 20                                             /**< (AON_GP_REGS_AON_MISC_CTRL) If set, this will force off the XO, otherwise XO is always on if BLE core is powered on. Position */
#define AON_GP_REGS_AON_MISC_CTRL_FORCE_OFF_XO_Msk (0x1u << AON_GP_REGS_AON_MISC_CTRL_FORCE_OFF_XO_Pos)  /**< (AON_GP_REGS_AON_MISC_CTRL) If set, this will force off the XO, otherwise XO is always on if BLE core is powered on. Mask */
#define AON_GP_REGS_AON_MISC_CTRL_FORCE_OFF_XO AON_GP_REGS_AON_MISC_CTRL_FORCE_OFF_XO_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_MISC_CTRL_FORCE_OFF_XO_Msk instead */
#define AON_GP_REGS_AON_MISC_CTRL_FORCE_XO_TO_BYPASS_MODE_Pos 21                                             /**< (AON_GP_REGS_AON_MISC_CTRL) If set, this will force the XO into bypass mode. Position */
#define AON_GP_REGS_AON_MISC_CTRL_FORCE_XO_TO_BYPASS_MODE_Msk (0x1u << AON_GP_REGS_AON_MISC_CTRL_FORCE_XO_TO_BYPASS_MODE_Pos)  /**< (AON_GP_REGS_AON_MISC_CTRL) If set, this will force the XO into bypass mode. Mask */
#define AON_GP_REGS_AON_MISC_CTRL_FORCE_XO_TO_BYPASS_MODE AON_GP_REGS_AON_MISC_CTRL_FORCE_XO_TO_BYPASS_MODE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_MISC_CTRL_FORCE_XO_TO_BYPASS_MODE_Msk instead */
#define AON_GP_REGS_AON_MISC_CTRL_MASK      0x3FC07Eu                                      /**< \deprecated (AON_GP_REGS_AON_MISC_CTRL) Register MASK  (Use AON_GP_REGS_AON_MISC_CTRL_Msk instead)  */
#define AON_GP_REGS_AON_MISC_CTRL_Msk       0x3FC07Eu                                      /**< (AON_GP_REGS_AON_MISC_CTRL) Register Mask  */

/* -------- AON_GP_REGS_AON_GLOBAL_RESET : (AON_GP_REGS Offset: 0x10) (R/W 8) Active Low Always On Reset Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  GLOBAL_RSTN:1;             /**< bit:      0  Global Reset                             */
    uint8_t  SLEEP_TIMER_RSTN:1;        /**< bit:      1  Sleep Timer Reset                        */
    uint8_t  :1;                        /**< bit:      2  Reserved */
    uint8_t  BLE_LP_RSTN:1;             /**< bit:      3  BLE Low Power Reset                      */
    uint8_t  PD4_RSTN:1;                /**< bit:      4  Allow the SW to force PD4 into reset     */
    uint8_t  :3;                        /**< bit:   5..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} AON_GP_REGS_AON_GLOBAL_RESET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

