remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/aon_gp_regs.h
#define AON_GP_REGS_AON_GLOBAL_RESET_OFFSET 0x10                                          /**<  (AON_GP_REGS_AON_GLOBAL_RESET) Active Low Always On Reset Control  Offset */
#define AON_GP_REGS_AON_GLOBAL_RESET_RESETVALUE 0x1Bu                                         /**<  (AON_GP_REGS_AON_GLOBAL_RESET) Active Low Always On Reset Control  Reset Value */

#define AON_GP_REGS_AON_GLOBAL_RESET_GLOBAL_RSTN_Pos 0                                              /**< (AON_GP_REGS_AON_GLOBAL_RESET) Global Reset Position */
#define AON_GP_REGS_AON_GLOBAL_RESET_GLOBAL_RSTN_Msk (0x1u << AON_GP_REGS_AON_GLOBAL_RESET_GLOBAL_RSTN_Pos)  /**< (AON_GP_REGS_AON_GLOBAL_RESET) Global Reset Mask */
#define AON_GP_REGS_AON_GLOBAL_RESET_GLOBAL_RSTN AON_GP_REGS_AON_GLOBAL_RESET_GLOBAL_RSTN_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_GLOBAL_RESET_GLOBAL_RSTN_Msk instead */
#define AON_GP_REGS_AON_GLOBAL_RESET_SLEEP_TIMER_RSTN_Pos 1                                              /**< (AON_GP_REGS_AON_GLOBAL_RESET) Sleep Timer Reset Position */
#define AON_GP_REGS_AON_GLOBAL_RESET_SLEEP_TIMER_RSTN_Msk (0x1u << AON_GP_REGS_AON_GLOBAL_RESET_SLEEP_TIMER_RSTN_Pos)  /**< (AON_GP_REGS_AON_GLOBAL_RESET) Sleep Timer Reset Mask */
#define AON_GP_REGS_AON_GLOBAL_RESET_SLEEP_TIMER_RSTN AON_GP_REGS_AON_GLOBAL_RESET_SLEEP_TIMER_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_GLOBAL_RESET_SLEEP_TIMER_RSTN_Msk instead */
#define AON_GP_REGS_AON_GLOBAL_RESET_BLE_LP_RSTN_Pos 3                                              /**< (AON_GP_REGS_AON_GLOBAL_RESET) BLE Low Power Reset Position */
#define AON_GP_REGS_AON_GLOBAL_RESET_BLE_LP_RSTN_Msk (0x1u << AON_GP_REGS_AON_GLOBAL_RESET_BLE_LP_RSTN_Pos)  /**< (AON_GP_REGS_AON_GLOBAL_RESET) BLE Low Power Reset Mask */
#define AON_GP_REGS_AON_GLOBAL_RESET_BLE_LP_RSTN AON_GP_REGS_AON_GLOBAL_RESET_BLE_LP_RSTN_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_GLOBAL_RESET_BLE_LP_RSTN_Msk instead */
#define AON_GP_REGS_AON_GLOBAL_RESET_PD4_RSTN_Pos 4                                              /**< (AON_GP_REGS_AON_GLOBAL_RESET) Allow the SW to force PD4 into reset Position */
#define AON_GP_REGS_AON_GLOBAL_RESET_PD4_RSTN_Msk (0x1u << AON_GP_REGS_AON_GLOBAL_RESET_PD4_RSTN_Pos)  /**< (AON_GP_REGS_AON_GLOBAL_RESET) Allow the SW to force PD4 into reset Mask */
#define AON_GP_REGS_AON_GLOBAL_RESET_PD4_RSTN AON_GP_REGS_AON_GLOBAL_RESET_PD4_RSTN_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_GLOBAL_RESET_PD4_RSTN_Msk instead */
#define AON_GP_REGS_AON_GLOBAL_RESET_MASK   0x1Bu                                          /**< \deprecated (AON_GP_REGS_AON_GLOBAL_RESET) Register MASK  (Use AON_GP_REGS_AON_GLOBAL_RESET_Msk instead)  */
#define AON_GP_REGS_AON_GLOBAL_RESET_Msk    0x1Bu                                          /**< (AON_GP_REGS_AON_GLOBAL_RESET) Register Mask  */

/* -------- AON_GP_REGS_AON_PULL_ENABLE : (AON_GP_REGS Offset: 0x14) (R/W 8) Active Low Always On Pull Enable Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  AO_GPIO_0:1;               /**< bit:      0  Pull Enable for AO_GPIO_0                */
    uint8_t  AO_GPIO_1:1;               /**< bit:      1  Pull Enable for AO_GPIO_1                */
    uint8_t  AO_GPIO_2:1;               /**< bit:      2  Pull Enable for AO_GPIO_2                */
    uint8_t  :5;                        /**< bit:   3..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint8_t  AO_GPIO_:3;                /**< bit:   0..2  Pull Enable for AO_GPIO_2                */
    uint8_t  :5;                        /**< bit:   3..7 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint8_t  reg;                         /**< Type used for register access */
} AON_GP_REGS_AON_PULL_ENABLE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_GP_REGS_AON_PULL_ENABLE_OFFSET  0x14                                          /**<  (AON_GP_REGS_AON_PULL_ENABLE) Active Low Always On Pull Enable Control  Offset */
#define AON_GP_REGS_AON_PULL_ENABLE_RESETVALUE 0x00u                                         /**<  (AON_GP_REGS_AON_PULL_ENABLE) Active Low Always On Pull Enable Control  Reset Value */

#define AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO_0_Pos 0                                              /**< (AON_GP_REGS_AON_PULL_ENABLE) Pull Enable for AO_GPIO_0 Position */
#define AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO_0_Msk (0x1u << AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO_0_Pos)  /**< (AON_GP_REGS_AON_PULL_ENABLE) Pull Enable for AO_GPIO_0 Mask */
#define AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO_0 AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO_0_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO_0_Msk instead */
#define AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO_1_Pos 1                                              /**< (AON_GP_REGS_AON_PULL_ENABLE) Pull Enable for AO_GPIO_1 Position */
#define AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO_1_Msk (0x1u << AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO_1_Pos)  /**< (AON_GP_REGS_AON_PULL_ENABLE) Pull Enable for AO_GPIO_1 Mask */
#define AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO_1 AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO_1_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO_1_Msk instead */
#define AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO_2_Pos 2                                              /**< (AON_GP_REGS_AON_PULL_ENABLE) Pull Enable for AO_GPIO_2 Position */
#define AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO_2_Msk (0x1u << AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO_2_Pos)  /**< (AON_GP_REGS_AON_PULL_ENABLE) Pull Enable for AO_GPIO_2 Mask */
#define AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO_2 AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO_2_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO_2_Msk instead */
#define AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO__Pos 0                                              /**< (AON_GP_REGS_AON_PULL_ENABLE Position) Pull Enable for AO_GPIO_2 */
#define AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO__Msk (0x7u << AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO__Pos)  /**< (AON_GP_REGS_AON_PULL_ENABLE Mask) AO_GPIO_ */
#define AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO_(value) (AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO__Msk & ((value) << AON_GP_REGS_AON_PULL_ENABLE_AO_GPIO__Pos))  
#define AON_GP_REGS_AON_PULL_ENABLE_MASK    0x07u                                          /**< \deprecated (AON_GP_REGS_AON_PULL_ENABLE) Register MASK  (Use AON_GP_REGS_AON_PULL_ENABLE_Msk instead)  */
#define AON_GP_REGS_AON_PULL_ENABLE_Msk     0x07u                                          /**< (AON_GP_REGS_AON_PULL_ENABLE) Register Mask  */

