remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/aon_gp_regs.h
/* -------- AON_GP_REGS_AON_RESET_CTRL : (AON_GP_REGS Offset: 0x1c) (R/W 32) Reset Count Control for PD1, PD4, PD6 and PD7 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :4;                        /**< bit:   0..3  Reserved */
    uint32_t PD1_COUNT:4;               /**< bit:   4..7  Number of clock cycles to delay the PD1 reset. (also for PD7) Upper 4 MSBs only (bits 3:0 will be forced to 0) */
    uint32_t :4;                        /**< bit:  8..11  Reserved */
    uint32_t PD4_COUNT:4;               /**< bit: 12..15  Number of clock cycles to delay the PD4 reset. Upper 4 MSBs only (bits 3:0 will be forced to 0) */
    uint32_t PD6_COUNT:4;               /**< bit: 16..19  Number of clock cycles to delay the PD6 reset */
    uint32_t :12;                       /**< bit: 20..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AON_GP_REGS_AON_RESET_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_GP_REGS_AON_RESET_CTRL_OFFSET   0x1C                                          /**<  (AON_GP_REGS_AON_RESET_CTRL) Reset Count Control for PD1, PD4, PD6 and PD7  Offset */
#define AON_GP_REGS_AON_RESET_CTRL_RESETVALUE 0x3A0A0u                                      /**<  (AON_GP_REGS_AON_RESET_CTRL) Reset Count Control for PD1, PD4, PD6 and PD7  Reset Value */

#define AON_GP_REGS_AON_RESET_CTRL_PD1_COUNT_Pos 4                                              /**< (AON_GP_REGS_AON_RESET_CTRL) Number of clock cycles to delay the PD1 reset. (also for PD7) Upper 4 MSBs only (bits 3:0 will be forced to 0) Position */
#define AON_GP_REGS_AON_RESET_CTRL_PD1_COUNT_Msk (0xFu << AON_GP_REGS_AON_RESET_CTRL_PD1_COUNT_Pos)  /**< (AON_GP_REGS_AON_RESET_CTRL) Number of clock cycles to delay the PD1 reset. (also for PD7) Upper 4 MSBs only (bits 3:0 will be forced to 0) Mask */
#define AON_GP_REGS_AON_RESET_CTRL_PD1_COUNT(value) (AON_GP_REGS_AON_RESET_CTRL_PD1_COUNT_Msk & ((value) << AON_GP_REGS_AON_RESET_CTRL_PD1_COUNT_Pos))
#define AON_GP_REGS_AON_RESET_CTRL_PD4_COUNT_Pos 12                                             /**< (AON_GP_REGS_AON_RESET_CTRL) Number of clock cycles to delay the PD4 reset. Upper 4 MSBs only (bits 3:0 will be forced to 0) Position */
#define AON_GP_REGS_AON_RESET_CTRL_PD4_COUNT_Msk (0xFu << AON_GP_REGS_AON_RESET_CTRL_PD4_COUNT_Pos)  /**< (AON_GP_REGS_AON_RESET_CTRL) Number of clock cycles to delay the PD4 reset. Upper 4 MSBs only (bits 3:0 will be forced to 0) Mask */
#define AON_GP_REGS_AON_RESET_CTRL_PD4_COUNT(value) (AON_GP_REGS_AON_RESET_CTRL_PD4_COUNT_Msk & ((value) << AON_GP_REGS_AON_RESET_CTRL_PD4_COUNT_Pos))
#define AON_GP_REGS_AON_RESET_CTRL_PD6_COUNT_Pos 16                                             /**< (AON_GP_REGS_AON_RESET_CTRL) Number of clock cycles to delay the PD6 reset Position */
#define AON_GP_REGS_AON_RESET_CTRL_PD6_COUNT_Msk (0xFu << AON_GP_REGS_AON_RESET_CTRL_PD6_COUNT_Pos)  /**< (AON_GP_REGS_AON_RESET_CTRL) Number of clock cycles to delay the PD6 reset Mask */
#define AON_GP_REGS_AON_RESET_CTRL_PD6_COUNT(value) (AON_GP_REGS_AON_RESET_CTRL_PD6_COUNT_Msk & ((value) << AON_GP_REGS_AON_RESET_CTRL_PD6_COUNT_Pos))
#define AON_GP_REGS_AON_RESET_CTRL_MASK     0xFF0F0u                                       /**< \deprecated (AON_GP_REGS_AON_RESET_CTRL) Register MASK  (Use AON_GP_REGS_AON_RESET_CTRL_Msk instead)  */
#define AON_GP_REGS_AON_RESET_CTRL_Msk      0xFF0F0u                                       /**< (AON_GP_REGS_AON_RESET_CTRL) Register Mask  */

/* -------- AON_GP_REGS_AON_BTRIM_ACTIVE : (AON_GP_REGS Offset: 0x20) (R/W 8) BTRIM settings for active mode (i.e. not in retention) -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  AON_BTRIM_ACTIVE:4;        /**< bit:   0..3                                           */
    uint8_t  :4;                        /**< bit:   4..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} AON_GP_REGS_AON_BTRIM_ACTIVE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_GP_REGS_AON_BTRIM_ACTIVE_OFFSET 0x20                                          /**<  (AON_GP_REGS_AON_BTRIM_ACTIVE) BTRIM settings for active mode (i.e. not in retention)  Offset */
#define AON_GP_REGS_AON_BTRIM_ACTIVE_RESETVALUE 0x08u                                         /**<  (AON_GP_REGS_AON_BTRIM_ACTIVE) BTRIM settings for active mode (i.e. not in retention)  Reset Value */

#define AON_GP_REGS_AON_BTRIM_ACTIVE_AON_BTRIM_ACTIVE_Pos 0                                              /**< (AON_GP_REGS_AON_BTRIM_ACTIVE)  Position */
#define AON_GP_REGS_AON_BTRIM_ACTIVE_AON_BTRIM_ACTIVE_Msk (0xFu << AON_GP_REGS_AON_BTRIM_ACTIVE_AON_BTRIM_ACTIVE_Pos)  /**< (AON_GP_REGS_AON_BTRIM_ACTIVE)  Mask */
#define AON_GP_REGS_AON_BTRIM_ACTIVE_AON_BTRIM_ACTIVE(value) (AON_GP_REGS_AON_BTRIM_ACTIVE_AON_BTRIM_ACTIVE_Msk & ((value) << AON_GP_REGS_AON_BTRIM_ACTIVE_AON_BTRIM_ACTIVE_Pos))
#define AON_GP_REGS_AON_BTRIM_ACTIVE_MASK   0x0Fu                                          /**< \deprecated (AON_GP_REGS_AON_BTRIM_ACTIVE) Register MASK  (Use AON_GP_REGS_AON_BTRIM_ACTIVE_Msk instead)  */
#define AON_GP_REGS_AON_BTRIM_ACTIVE_Msk    0x0Fu                                          /**< (AON_GP_REGS_AON_BTRIM_ACTIVE) Register Mask  */

/* -------- AON_GP_REGS_AON_BTRIM_RETENTION : (AON_GP_REGS Offset: 0x24) (R/W 8) BTRIM settings for retention mode -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  AON_BTRIM_RETENTION:4;     /**< bit:   0..3                                           */
    uint8_t  :4;                        /**< bit:   4..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} AON_GP_REGS_AON_BTRIM_RETENTION_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_GP_REGS_AON_BTRIM_RETENTION_OFFSET 0x24                                          /**<  (AON_GP_REGS_AON_BTRIM_RETENTION) BTRIM settings for retention mode  Offset */
#define AON_GP_REGS_AON_BTRIM_RETENTION_RESETVALUE 0x08u                                         /**<  (AON_GP_REGS_AON_BTRIM_RETENTION) BTRIM settings for retention mode  Reset Value */

#define AON_GP_REGS_AON_BTRIM_RETENTION_AON_BTRIM_RETENTION_Pos 0                                              /**< (AON_GP_REGS_AON_BTRIM_RETENTION)  Position */
#define AON_GP_REGS_AON_BTRIM_RETENTION_AON_BTRIM_RETENTION_Msk (0xFu << AON_GP_REGS_AON_BTRIM_RETENTION_AON_BTRIM_RETENTION_Pos)  /**< (AON_GP_REGS_AON_BTRIM_RETENTION)  Mask */
#define AON_GP_REGS_AON_BTRIM_RETENTION_AON_BTRIM_RETENTION(value) (AON_GP_REGS_AON_BTRIM_RETENTION_AON_BTRIM_RETENTION_Msk & ((value) << AON_GP_REGS_AON_BTRIM_RETENTION_AON_BTRIM_RETENTION_Pos))
#define AON_GP_REGS_AON_BTRIM_RETENTION_MASK 0x0Fu                                          /**< \deprecated (AON_GP_REGS_AON_BTRIM_RETENTION) Register MASK  (Use AON_GP_REGS_AON_BTRIM_RETENTION_Msk instead)  */
#define AON_GP_REGS_AON_BTRIM_RETENTION_Msk 0x0Fu                                          /**< (AON_GP_REGS_AON_BTRIM_RETENTION) Register Mask  */

/* -------- AON_GP_REGS_AON_LPMCU_SCRATCH_PAD : (AON_GP_REGS Offset: 0x40) (R/W 8) Usage for the LPMCU for any sort of status it needs to store for itself before it goes to sleep -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  AON_LPMCU_SCRATCH_PAD:8;   /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} AON_GP_REGS_AON_LPMCU_SCRATCH_PAD_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_GP_REGS_AON_LPMCU_SCRATCH_PAD_OFFSET 0x40                                          /**<  (AON_GP_REGS_AON_LPMCU_SCRATCH_PAD) Usage for the LPMCU for any sort of status it needs to store for itself before it goes to sleep  Offset */
#define AON_GP_REGS_AON_LPMCU_SCRATCH_PAD_RESETVALUE 0x00u                                         /**<  (AON_GP_REGS_AON_LPMCU_SCRATCH_PAD) Usage for the LPMCU for any sort of status it needs to store for itself before it goes to sleep  Reset Value */

#define AON_GP_REGS_AON_LPMCU_SCRATCH_PAD_AON_LPMCU_SCRATCH_PAD_Pos 0                                              /**< (AON_GP_REGS_AON_LPMCU_SCRATCH_PAD)  Position */
#define AON_GP_REGS_AON_LPMCU_SCRATCH_PAD_AON_LPMCU_SCRATCH_PAD_Msk (0xFFu << AON_GP_REGS_AON_LPMCU_SCRATCH_PAD_AON_LPMCU_SCRATCH_PAD_Pos)  /**< (AON_GP_REGS_AON_LPMCU_SCRATCH_PAD)  Mask */
#define AON_GP_REGS_AON_LPMCU_SCRATCH_PAD_AON_LPMCU_SCRATCH_PAD(value) (AON_GP_REGS_AON_LPMCU_SCRATCH_PAD_AON_LPMCU_SCRATCH_PAD_Msk & ((value) << AON_GP_REGS_AON_LPMCU_SCRATCH_PAD_AON_LPMCU_SCRATCH_PAD_Pos))
#define AON_GP_REGS_AON_LPMCU_SCRATCH_PAD_MASK 0xFFu                                          /**< \deprecated (AON_GP_REGS_AON_LPMCU_SCRATCH_PAD) Register MASK  (Use AON_GP_REGS_AON_LPMCU_SCRATCH_PAD_Msk instead)  */
#define AON_GP_REGS_AON_LPMCU_SCRATCH_PAD_Msk 0xFFu                                          /**< (AON_GP_REGS_AON_LPMCU_SCRATCH_PAD) Register Mask  */

/* -------- AON_GP_REGS_AON_LPMCU_COLD_BOOT : (AON_GP_REGS Offset: 0x44) (R/W 8) To be used by ARM to determine if it is a cold boot or not -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  AON_LPMCU_COLD_BOOT:8;     /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} AON_GP_REGS_AON_LPMCU_COLD_BOOT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_GP_REGS_AON_LPMCU_COLD_BOOT_OFFSET 0x44                                          /**<  (AON_GP_REGS_AON_LPMCU_COLD_BOOT) To be used by ARM to determine if it is a cold boot or not  Offset */
#define AON_GP_REGS_AON_LPMCU_COLD_BOOT_RESETVALUE 0x78u                                         /**<  (AON_GP_REGS_AON_LPMCU_COLD_BOOT) To be used by ARM to determine if it is a cold boot or not  Reset Value */

#define AON_GP_REGS_AON_LPMCU_COLD_BOOT_AON_LPMCU_COLD_BOOT_Pos 0                                              /**< (AON_GP_REGS_AON_LPMCU_COLD_BOOT)  Position */
#define AON_GP_REGS_AON_LPMCU_COLD_BOOT_AON_LPMCU_COLD_BOOT_Msk (0xFFu << AON_GP_REGS_AON_LPMCU_COLD_BOOT_AON_LPMCU_COLD_BOOT_Pos)  /**< (AON_GP_REGS_AON_LPMCU_COLD_BOOT)  Mask */
#define AON_GP_REGS_AON_LPMCU_COLD_BOOT_AON_LPMCU_COLD_BOOT(value) (AON_GP_REGS_AON_LPMCU_COLD_BOOT_AON_LPMCU_COLD_BOOT_Msk & ((value) << AON_GP_REGS_AON_LPMCU_COLD_BOOT_AON_LPMCU_COLD_BOOT_Pos))
#define AON_GP_REGS_AON_LPMCU_COLD_BOOT_MASK 0xFFu                                          /**< \deprecated (AON_GP_REGS_AON_LPMCU_COLD_BOOT) Register MASK  (Use AON_GP_REGS_AON_LPMCU_COLD_BOOT_Msk instead)  */
#define AON_GP_REGS_AON_LPMCU_COLD_BOOT_Msk 0xFFu                                          /**< (AON_GP_REGS_AON_LPMCU_COLD_BOOT) Register Mask  */

