remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/aon_gp_regs.h
/* -------- AON_GP_REGS_AON_BO_OUT_STATUS : (AON_GP_REGS Offset: 0x80) (R/ 8) Brown Out Detected (must be cleared manually) -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  AON_BO_OUT_STATUS:1;       /**< bit:      0                                           */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} AON_GP_REGS_AON_BO_OUT_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_GP_REGS_AON_BO_OUT_STATUS_OFFSET 0x80                                          /**<  (AON_GP_REGS_AON_BO_OUT_STATUS) Brown Out Detected (must be cleared manually)  Offset */
#define AON_GP_REGS_AON_BO_OUT_STATUS_RESETVALUE 0x00u                                         /**<  (AON_GP_REGS_AON_BO_OUT_STATUS) Brown Out Detected (must be cleared manually)  Reset Value */

#define AON_GP_REGS_AON_BO_OUT_STATUS_AON_BO_OUT_STATUS_Pos 0                                              /**< (AON_GP_REGS_AON_BO_OUT_STATUS)  Position */
#define AON_GP_REGS_AON_BO_OUT_STATUS_AON_BO_OUT_STATUS_Msk (0x1u << AON_GP_REGS_AON_BO_OUT_STATUS_AON_BO_OUT_STATUS_Pos)  /**< (AON_GP_REGS_AON_BO_OUT_STATUS)  Mask */
#define AON_GP_REGS_AON_BO_OUT_STATUS_AON_BO_OUT_STATUS AON_GP_REGS_AON_BO_OUT_STATUS_AON_BO_OUT_STATUS_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_AON_BO_OUT_STATUS_AON_BO_OUT_STATUS_Msk instead */
#define AON_GP_REGS_AON_BO_OUT_STATUS_MASK  0x01u                                          /**< \deprecated (AON_GP_REGS_AON_BO_OUT_STATUS) Register MASK  (Use AON_GP_REGS_AON_BO_OUT_STATUS_Msk instead)  */
#define AON_GP_REGS_AON_BO_OUT_STATUS_Msk   0x01u                                          /**< (AON_GP_REGS_AON_BO_OUT_STATUS) Register Mask  */

/* -------- AON_GP_REGS_CLEAR_BROWN_OUT_REG : (AON_GP_REGS Offset: 0x84) (R/W 8) Set to 1 to clear (hold until 0 read at aon_bo_out_status and then this must be cleared to detect another brown out condition) -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CLEAR_BROWN_OUT_REG:1;     /**< bit:      0                                           */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} AON_GP_REGS_CLEAR_BROWN_OUT_REG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_GP_REGS_CLEAR_BROWN_OUT_REG_OFFSET 0x84                                          /**<  (AON_GP_REGS_CLEAR_BROWN_OUT_REG) Set to 1 to clear (hold until 0 read at aon_bo_out_status and then this must be cleared to detect another brown out condition)  Offset */
#define AON_GP_REGS_CLEAR_BROWN_OUT_REG_RESETVALUE 0x00u                                         /**<  (AON_GP_REGS_CLEAR_BROWN_OUT_REG) Set to 1 to clear (hold until 0 read at aon_bo_out_status and then this must be cleared to detect another brown out condition)  Reset Value */

#define AON_GP_REGS_CLEAR_BROWN_OUT_REG_CLEAR_BROWN_OUT_REG_Pos 0                                              /**< (AON_GP_REGS_CLEAR_BROWN_OUT_REG)  Position */
#define AON_GP_REGS_CLEAR_BROWN_OUT_REG_CLEAR_BROWN_OUT_REG_Msk (0x1u << AON_GP_REGS_CLEAR_BROWN_OUT_REG_CLEAR_BROWN_OUT_REG_Pos)  /**< (AON_GP_REGS_CLEAR_BROWN_OUT_REG)  Mask */
#define AON_GP_REGS_CLEAR_BROWN_OUT_REG_CLEAR_BROWN_OUT_REG AON_GP_REGS_CLEAR_BROWN_OUT_REG_CLEAR_BROWN_OUT_REG_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_CLEAR_BROWN_OUT_REG_CLEAR_BROWN_OUT_REG_Msk instead */
#define AON_GP_REGS_CLEAR_BROWN_OUT_REG_MASK 0x01u                                          /**< \deprecated (AON_GP_REGS_CLEAR_BROWN_OUT_REG) Register MASK  (Use AON_GP_REGS_CLEAR_BROWN_OUT_REG_Msk instead)  */
#define AON_GP_REGS_CLEAR_BROWN_OUT_REG_Msk 0x01u                                          /**< (AON_GP_REGS_CLEAR_BROWN_OUT_REG) Register Mask  */

/* -------- AON_GP_REGS_RF_PMU_REGS_0 : (AON_GP_REGS Offset: 0x400) (R/W 32) RF PMU Registers -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CLK_EDGE_SEL:1;            /**< bit:      0  Select clock edge for Vreg comparator in buck converter */
    uint32_t VOUT_CTRL_BUCK:4;          /**< bit:   1..4  Select the output voltage of the buck converter */
    uint32_t CLK_2_4:1;                 /**< bit:      5  Comparator clock divider in buck converter */
    uint32_t VREG_FILT_CTRL:2;          /**< bit:   6..7  Not Used                                 */
    uint32_t CLK_DIV:3;                 /**< bit:  8..10  Programmable divider that sets the on duration of positive charging pulse */
    uint32_t RESET_FSM:1;               /**< bit:     11  Force reset of FSM in buck converter     */
    uint32_t EN_TRISTATE:1;             /**< bit:     12  Allow tristate_ctrl to control minimum time between pulses of the buck converter */
    uint32_t TRISTATE_CTRL:3;           /**< bit: 13..15  Controls the minimum time between pulses in the buck converter */
    uint32_t OFFSETP_CTRL:4;            /**< bit: 16..19  Controls a fixed comparator offset in the buck converter for positive pulses */
    uint32_t OFFSETN_CTRL:4;            /**< bit: 20..23  Controls a fixed comparator offset in the buck converter for negative pulses */
    uint32_t P_SW_CTRL:7;               /**< bit: 24..30  Power switch units for the buck converter */
    uint32_t CLK_SEL:1;                 /**< bit:     31  Source clock for the buck converter      */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AON_GP_REGS_RF_PMU_REGS_0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_GP_REGS_RF_PMU_REGS_0_OFFSET    0x400                                         /**<  (AON_GP_REGS_RF_PMU_REGS_0) RF PMU Registers  Offset */
#define AON_GP_REGS_RF_PMU_REGS_0_RESETVALUE 0xF600409u                                    /**<  (AON_GP_REGS_RF_PMU_REGS_0) RF PMU Registers  Reset Value */

