remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/aon_gp_regs.h
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_EDGE_SEL_Pos 0                                              /**< (AON_GP_REGS_RF_PMU_REGS_0) Select clock edge for Vreg comparator in buck converter Position */
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_EDGE_SEL_Msk (0x1u << AON_GP_REGS_RF_PMU_REGS_0_CLK_EDGE_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Select clock edge for Vreg comparator in buck converter Mask */
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_EDGE_SEL AON_GP_REGS_RF_PMU_REGS_0_CLK_EDGE_SEL_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_RF_PMU_REGS_0_CLK_EDGE_SEL_Msk instead */
#define   AON_GP_REGS_RF_PMU_REGS_0_CLK_EDGE_SEL_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) Comparator samples on rising edge of clock  */
#define   AON_GP_REGS_RF_PMU_REGS_0_CLK_EDGE_SEL_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) Comparator samples on falling edge of clock  */
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_EDGE_SEL_0 (AON_GP_REGS_RF_PMU_REGS_0_CLK_EDGE_SEL_0_Val << AON_GP_REGS_RF_PMU_REGS_0_CLK_EDGE_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Comparator samples on rising edge of clock Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_EDGE_SEL_1 (AON_GP_REGS_RF_PMU_REGS_0_CLK_EDGE_SEL_1_Val << AON_GP_REGS_RF_PMU_REGS_0_CLK_EDGE_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Comparator samples on falling edge of clock Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_Pos 1                                              /**< (AON_GP_REGS_RF_PMU_REGS_0) Select the output voltage of the buck converter Position */
#define AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_Msk (0xFu << AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Select the output voltage of the buck converter Mask */
#define AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK(value) (AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_Msk & ((value) << AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_Pos))
#define   AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.12V  */
#define   AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.15V  */
#define   AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_2_Val 0x2u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.17V  */
#define   AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_3_Val 0x3u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.20V  */
#define   AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_4_Val 0x4u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.22V  */
#define   AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_5_Val 0x5u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.25V  */
#define   AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_6_Val 0x6u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.27V  */
#define   AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_7_Val 0x7u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.30V  */
#define   AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_8_Val 0x8u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.32V  */
#define   AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_9_Val 0x9u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.35V  */
#define   AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_10_Val 0xAu                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.37V  */
#define   AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_11_Val 0xBu                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.40V  */
#define   AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_12_Val 0xCu                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.42V  */
#define   AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_13_Val 0xDu                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.45V  */
#define   AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_14_Val 0xEu                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.47V  */
#define   AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_15_Val 0xFu                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.50V  */
#define AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_0 (AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_0_Val << AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.12V Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_1 (AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_1_Val << AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.15V Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_2 (AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_2_Val << AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.17V Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_3 (AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_3_Val << AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.20V Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_4 (AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_4_Val << AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.22V Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_5 (AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_5_Val << AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.25V Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_6 (AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_6_Val << AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.27V Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_7 (AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_7_Val << AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.30V Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_8 (AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_8_Val << AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.32V Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_9 (AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_9_Val << AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.35V Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_10 (AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_10_Val << AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.37V Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_11 (AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_11_Val << AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.40V Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_12 (AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_12_Val << AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.42V Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_13 (AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_13_Val << AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.45V Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_14 (AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_14_Val << AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.47V Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_15 (AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_15_Val << AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.50V Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_2_4_Pos 5                                              /**< (AON_GP_REGS_RF_PMU_REGS_0) Comparator clock divider in buck converter Position */
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_2_4_Msk (0x1u << AON_GP_REGS_RF_PMU_REGS_0_CLK_2_4_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Comparator clock divider in buck converter Mask */
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_2_4   AON_GP_REGS_RF_PMU_REGS_0_CLK_2_4_Msk          /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_RF_PMU_REGS_0_CLK_2_4_Msk instead */
#define   AON_GP_REGS_RF_PMU_REGS_0_CLK_2_4_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 2  */
#define   AON_GP_REGS_RF_PMU_REGS_0_CLK_2_4_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 4  */
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_2_4_0 (AON_GP_REGS_RF_PMU_REGS_0_CLK_2_4_0_Val << AON_GP_REGS_RF_PMU_REGS_0_CLK_2_4_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 2 Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_2_4_1 (AON_GP_REGS_RF_PMU_REGS_0_CLK_2_4_1_Val << AON_GP_REGS_RF_PMU_REGS_0_CLK_2_4_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 4 Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_VREG_FILT_CTRL_Pos 6                                              /**< (AON_GP_REGS_RF_PMU_REGS_0) Not Used Position */
#define AON_GP_REGS_RF_PMU_REGS_0_VREG_FILT_CTRL_Msk (0x3u << AON_GP_REGS_RF_PMU_REGS_0_VREG_FILT_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Not Used Mask */
#define AON_GP_REGS_RF_PMU_REGS_0_VREG_FILT_CTRL(value) (AON_GP_REGS_RF_PMU_REGS_0_VREG_FILT_CTRL_Msk & ((value) << AON_GP_REGS_RF_PMU_REGS_0_VREG_FILT_CTRL_Pos))
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_Pos 8                                              /**< (AON_GP_REGS_RF_PMU_REGS_0) Programmable divider that sets the on duration of positive charging pulse Position */
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_Msk (0x7u << AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Programmable divider that sets the on duration of positive charging pulse Mask */
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV(value) (AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_Msk & ((value) << AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_Pos))
#define   AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 4  */
#define   AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 6  */
#define   AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_2_Val 0x2u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 8  */
#define   AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_3_Val 0x3u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 10  */
#define   AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_4_Val 0x4u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 12  */
#define   AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_5_Val 0x5u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 14  */
#define   AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_6_Val 0x6u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 16  */
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_0 (AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_0_Val << AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 4 Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_1 (AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_1_Val << AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 6 Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_2 (AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_2_Val << AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 8 Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_3 (AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_3_Val << AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 10 Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_4 (AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_4_Val << AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 12 Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_5 (AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_5_Val << AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 14 Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_6 (AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_6_Val << AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 16 Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_RESET_FSM_Pos 11                                             /**< (AON_GP_REGS_RF_PMU_REGS_0) Force reset of FSM in buck converter Position */
#define AON_GP_REGS_RF_PMU_REGS_0_RESET_FSM_Msk (0x1u << AON_GP_REGS_RF_PMU_REGS_0_RESET_FSM_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Force reset of FSM in buck converter Mask */
#define AON_GP_REGS_RF_PMU_REGS_0_RESET_FSM AON_GP_REGS_RF_PMU_REGS_0_RESET_FSM_Msk        /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_RF_PMU_REGS_0_RESET_FSM_Msk instead */
#define   AON_GP_REGS_RF_PMU_REGS_0_RESET_FSM_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) FSM is not reset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_RESET_FSM_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) FSM is reset  */
#define AON_GP_REGS_RF_PMU_REGS_0_RESET_FSM_0 (AON_GP_REGS_RF_PMU_REGS_0_RESET_FSM_0_Val << AON_GP_REGS_RF_PMU_REGS_0_RESET_FSM_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) FSM is not reset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_RESET_FSM_1 (AON_GP_REGS_RF_PMU_REGS_0_RESET_FSM_1_Val << AON_GP_REGS_RF_PMU_REGS_0_RESET_FSM_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) FSM is reset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_EN_TRISTATE_Pos 12                                             /**< (AON_GP_REGS_RF_PMU_REGS_0) Allow tristate_ctrl to control minimum time between pulses of the buck converter Position */
#define AON_GP_REGS_RF_PMU_REGS_0_EN_TRISTATE_Msk (0x1u << AON_GP_REGS_RF_PMU_REGS_0_EN_TRISTATE_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Allow tristate_ctrl to control minimum time between pulses of the buck converter Mask */
#define AON_GP_REGS_RF_PMU_REGS_0_EN_TRISTATE AON_GP_REGS_RF_PMU_REGS_0_EN_TRISTATE_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_RF_PMU_REGS_0_EN_TRISTATE_Msk instead */
#define   AON_GP_REGS_RF_PMU_REGS_0_EN_TRISTATE_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) Tristate logic disable  */
#define   AON_GP_REGS_RF_PMU_REGS_0_EN_TRISTATE_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) Tristate logic enabled  */
#define AON_GP_REGS_RF_PMU_REGS_0_EN_TRISTATE_0 (AON_GP_REGS_RF_PMU_REGS_0_EN_TRISTATE_0_Val << AON_GP_REGS_RF_PMU_REGS_0_EN_TRISTATE_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Tristate logic disable Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_EN_TRISTATE_1 (AON_GP_REGS_RF_PMU_REGS_0_EN_TRISTATE_1_Val << AON_GP_REGS_RF_PMU_REGS_0_EN_TRISTATE_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Tristate logic enabled Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_Pos 13                                             /**< (AON_GP_REGS_RF_PMU_REGS_0) Controls the minimum time between pulses in the buck converter Position */
#define AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_Msk (0x7u << AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Controls the minimum time between pulses in the buck converter Mask */
#define AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL(value) (AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_Msk & ((value) << AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_Pos))
#define   AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 4  */
#define   AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 6  */
#define   AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_2_Val 0x2u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 8  */
#define   AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_3_Val 0x3u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 10  */
#define   AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_4_Val 0x4u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 12  */
#define   AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_5_Val 0x5u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 14  */
#define   AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_6_Val 0x6u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 16  */
#define AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_0 (AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_0_Val << AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 4 Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_1 (AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_1_Val << AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 6 Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_2 (AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_2_Val << AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 8 Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_3 (AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_3_Val << AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 10 Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_4 (AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_4_Val << AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 12 Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_5 (AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_5_Val << AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 14 Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_6 (AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_6_Val << AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Divide by 16 Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_Pos 16                                             /**< (AON_GP_REGS_RF_PMU_REGS_0) Controls a fixed comparator offset in the buck converter for positive pulses Position */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_Msk (0xFu << AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Controls a fixed comparator offset in the buck converter for positive pulses Mask */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL(value) (AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_Msk & ((value) << AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_Pos))
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 0.0mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 0.4mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_2_Val 0x2u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 0.8mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_3_Val 0x3u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.2mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_4_Val 0x4u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.6mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_5_Val 0x5u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 2.0mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_6_Val 0x6u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 2.4mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_7_Val 0x7u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 2.8mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_8_Val 0x8u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 3.2mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_9_Val 0x9u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 3.6mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_10_Val 0xAu                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 4.0mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_11_Val 0xBu                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 4.4mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_12_Val 0xCu                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 4.8mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_13_Val 0xDu                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 5.2mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_14_Val 0xEu                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 5.6mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_15_Val 0xFu                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 6.0mV offset  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_0 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_0_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 0.0mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_1 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_1_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 0.4mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_2 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_2_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 0.8mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_3 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_3_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.2mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_4 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_4_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.6mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_5 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_5_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 2.0mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_6 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_6_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 2.4mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_7 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_7_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 2.8mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_8 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_8_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 3.2mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_9 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_9_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 3.6mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_10 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_10_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 4.0mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_11 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_11_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 4.4mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_12 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_12_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 4.8mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_13 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_13_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 5.2mV offset Position  */
