remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/aon_gp_regs.h
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_14 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_14_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 5.6mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_15 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_15_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 6.0mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_Pos 20                                             /**< (AON_GP_REGS_RF_PMU_REGS_0) Controls a fixed comparator offset in the buck converter for negative pulses Position */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_Msk (0xFu << AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Controls a fixed comparator offset in the buck converter for negative pulses Mask */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL(value) (AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_Msk & ((value) << AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_Pos))
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 0.0mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 0.4mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_2_Val 0x2u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 0.8mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_3_Val 0x3u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.2mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_4_Val 0x4u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.6mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_5_Val 0x5u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 2.0mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_6_Val 0x6u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 2.4mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_7_Val 0x7u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 2.8mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_8_Val 0x8u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 3.2mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_9_Val 0x9u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 3.6mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_10_Val 0xAu                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 4.0mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_11_Val 0xBu                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 4.4mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_12_Val 0xCu                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 4.8mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_13_Val 0xDu                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 5.2mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_14_Val 0xEu                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 5.6mV offset  */
#define   AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_15_Val 0xFu                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 6.0mV offset  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_0 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_0_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 0.0mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_1 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_1_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 0.4mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_2 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_2_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 0.8mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_3 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_3_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.2mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_4 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_4_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 1.6mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_5 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_5_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 2.0mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_6 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_6_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 2.4mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_7 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_7_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 2.8mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_8 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_8_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 3.2mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_9 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_9_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 3.6mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_10 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_10_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 4.0mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_11 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_11_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 4.4mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_12 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_12_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 4.8mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_13 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_13_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 5.2mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_14 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_14_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 5.6mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_15 (AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_15_Val << AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 6.0mV offset Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_Pos 24                                             /**< (AON_GP_REGS_RF_PMU_REGS_0) Power switch units for the buck converter Position */
#define AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_Msk (0x7Fu << AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Power switch units for the buck converter Mask */
#define AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL(value) (AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_Msk & ((value) << AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_Pos))
#define   AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 0 power switches enabled  */
#define   AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 1 power switch enabled  */
#define   AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_3_Val 0x3u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 2 power switches enabled  */
#define   AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_7_Val 0x7u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 3 power switches enabled  */
#define   AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_15_Val 0xFu                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) 4 power switches enabled  */
#define   AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_31_Val 0x1Fu                                          /**< (AON_GP_REGS_RF_PMU_REGS_0) 5 power switches enabled  */
#define   AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_63_Val 0x3Fu                                          /**< (AON_GP_REGS_RF_PMU_REGS_0) 6 power switches enabled  */
#define AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_0 (AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_0_Val << AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 0 power switches enabled Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_1 (AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_1_Val << AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 1 power switch enabled Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_3 (AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_3_Val << AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 2 power switches enabled Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_7 (AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_7_Val << AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 3 power switches enabled Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_15 (AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_15_Val << AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 4 power switches enabled Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_31 (AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_31_Val << AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 5 power switches enabled Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_63 (AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_63_Val << AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) 6 power switches enabled Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_SEL_Pos 31                                             /**< (AON_GP_REGS_RF_PMU_REGS_0) Source clock for the buck converter Position */
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_SEL_Msk (0x1u << AON_GP_REGS_RF_PMU_REGS_0_CLK_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Source clock for the buck converter Mask */
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_SEL   AON_GP_REGS_RF_PMU_REGS_0_CLK_SEL_Msk          /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_RF_PMU_REGS_0_CLK_SEL_Msk instead */
#define   AON_GP_REGS_RF_PMU_REGS_0_CLK_SEL_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) Internal 26MHz clock  */
#define   AON_GP_REGS_RF_PMU_REGS_0_CLK_SEL_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_0) External 52MHz clock  */
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_SEL_0 (AON_GP_REGS_RF_PMU_REGS_0_CLK_SEL_0_Val << AON_GP_REGS_RF_PMU_REGS_0_CLK_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) Internal 26MHz clock Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_CLK_SEL_1 (AON_GP_REGS_RF_PMU_REGS_0_CLK_SEL_1_Val << AON_GP_REGS_RF_PMU_REGS_0_CLK_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_0) External 52MHz clock Position  */
#define AON_GP_REGS_RF_PMU_REGS_0_MASK      0xFFFFFFFFu                                    /**< \deprecated (AON_GP_REGS_RF_PMU_REGS_0) Register MASK  (Use AON_GP_REGS_RF_PMU_REGS_0_Msk instead)  */
#define AON_GP_REGS_RF_PMU_REGS_0_Msk       0xFFFFFFFFu                                    /**< (AON_GP_REGS_RF_PMU_REGS_0) Register Mask  */

/* -------- AON_GP_REGS_RF_PMU_REGS_1 : (AON_GP_REGS Offset: 0x404) (R/W 32) RF PMU Registers -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t SADC_BIAS_RES_CTRL:4;      /**< bit:   0..3  Internal reference voltage level for sensor ADC */
    uint32_t SADC_REF_SEL:3;            /**< bit:   4..6  Reference Voltage Source for the Sensor ADC */
    uint32_t BOD_EN:1;                  /**< bit:      7  Brown Out Detector Enable Control        */
    uint32_t LPD_CLK_INJECT_EN:1;       /**< bit:      8  Low Power Domain Clock Injection Enable Control */
    uint32_t EFUSE_LDO_BYP:1;           /**< bit:      9  Bypass controlf for EFUSE LDO            */
    uint32_t EFUSE_LDO_VOUT_CTRL:3;     /**< bit: 10..12  Output voltage of EFUSE LDO              */
    uint32_t EFUSE_LDO_IBIAS_CTRL:2;    /**< bit: 13..14  Set the current bias for the EFUSE LDO   */
    uint32_t PIERCE_RES_CTRL:1;         /**< bit:     15  RTC crystal circuit feedback resistance value */
    uint32_t PIERCE_GM_CTRL:4;          /**< bit: 16..19  Transconductance of RTC oscillator       */
    uint32_t PIERCE_CAP_CTRL:4;         /**< bit: 20..23  On chip single ended capacitors for RTC oscillator */
    uint32_t SADC_CHN_CTRL:1;           /**< bit:     24  enable input channel time multiplexing to the sensor ADC */
    uint32_t SADC_CHN_SEL:3;            /**< bit: 25..27  Input channel selection for the sensor ADC */
    uint32_t CODE_IN:2;                 /**< bit: 28..29  Optional mode to improve sub-ranging technique of the sensor ADC */
    uint32_t SADC_LP_CTRL:2;            /**< bit: 30..31  Comparator biasing current for different sampling rates of the sensor ADC */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AON_GP_REGS_RF_PMU_REGS_1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_GP_REGS_RF_PMU_REGS_1_OFFSET    0x404                                         /**<  (AON_GP_REGS_RF_PMU_REGS_1) RF PMU Registers  Offset */
#define AON_GP_REGS_RF_PMU_REGS_1_RESETVALUE 0x31888C82u                                   /**<  (AON_GP_REGS_RF_PMU_REGS_1) RF PMU Registers  Reset Value */

