remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/aon_gp_regs.h
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_Pos 0                                              /**< (AON_GP_REGS_RF_PMU_REGS_1) Internal reference voltage level for sensor ADC Position */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_Msk (0xFu << AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) Internal reference voltage level for sensor ADC Mask */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL(value) (AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_Msk & ((value) << AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_Pos))
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 0.5V  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 0.6V  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_2_Val 0x2u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 0.7V  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_3_Val 0x3u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 0.8V  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_4_Val 0x4u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 0.9V  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_5_Val 0x5u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 1.0V  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_6_Val 0x6u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 1.1V (only for VBATT gt 2.0V)  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_7_Val 0x7u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 1.2V (only for VBATT gt 2.0V)  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_8_Val 0x8u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 1.3V (only for VBATT gt 2.0V)  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_9_Val 0x9u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 1.4V (only for VBATT gt 2.0V)  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_10_Val 0xAu                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 1.5V (only for VBATT gt 2.0V)  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_11_Val 0xBu                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 1.6V (only for VBATT gt 2.0V)  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_12_Val 0xCu                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 1.7V (only for VBATT gt 2.0V)  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_13_Val 0xDu                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 1.8V (only for VBATT gt 2.0V)  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_14_Val 0xEu                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 1.9V (only for VBATT gt 2.0V)  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_15_Val 0xFu                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 2.0V (only for VBATT gt 2.0V)  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_0 (AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_0_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 0.5V Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_1 (AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_1_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 0.6V Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_2 (AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_2_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 0.7V Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_3 (AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_3_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 0.8V Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_4 (AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_4_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 0.9V Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_5 (AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_5_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 1.0V Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_6 (AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_6_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 1.1V (only for VBATT gt 2.0V) Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_7 (AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_7_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 1.2V (only for VBATT gt 2.0V) Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_8 (AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_8_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 1.3V (only for VBATT gt 2.0V) Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_9 (AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_9_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 1.4V (only for VBATT gt 2.0V) Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_10 (AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_10_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 1.5V (only for VBATT gt 2.0V) Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_11 (AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_11_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 1.6V (only for VBATT gt 2.0V) Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_12 (AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_12_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 1.7V (only for VBATT gt 2.0V) Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_13 (AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_13_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 1.8V (only for VBATT gt 2.0V) Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_14 (AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_14_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 1.9V (only for VBATT gt 2.0V) Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_15 (AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_15_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 2.0V (only for VBATT gt 2.0V) Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_Pos 4                                              /**< (AON_GP_REGS_RF_PMU_REGS_1) Reference Voltage Source for the Sensor ADC Position */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_Msk (0x7u << AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) Reference Voltage Source for the Sensor ADC Mask */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL(value) (AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_Msk & ((value) << AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_Pos))
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) Buffered reference voltage  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) IR voltage  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_2_Val 0x2u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) VBATT divided by 2  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_3_Val 0x3u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) GPIO_MS1  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_4_Val 0x4u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) GPIO_MS2  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_5_Val 0x5u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) GPIO_MS3  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_6_Val 0x6u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) GPIO_MS4  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_7_Val 0x7u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) VBATT supply voltage  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_0 (AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_0_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) Buffered reference voltage Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_1 (AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_1_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) IR voltage Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_2 (AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_2_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) VBATT divided by 2 Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_3 (AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_3_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) GPIO_MS1 Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_4 (AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_4_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) GPIO_MS2 Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_5 (AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_5_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) GPIO_MS3 Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_6 (AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_6_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) GPIO_MS4 Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_7 (AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_7_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) VBATT supply voltage Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_BOD_EN_Pos 7                                              /**< (AON_GP_REGS_RF_PMU_REGS_1) Brown Out Detector Enable Control Position */
#define AON_GP_REGS_RF_PMU_REGS_1_BOD_EN_Msk (0x1u << AON_GP_REGS_RF_PMU_REGS_1_BOD_EN_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) Brown Out Detector Enable Control Mask */
#define AON_GP_REGS_RF_PMU_REGS_1_BOD_EN    AON_GP_REGS_RF_PMU_REGS_1_BOD_EN_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_RF_PMU_REGS_1_BOD_EN_Msk instead */
#define   AON_GP_REGS_RF_PMU_REGS_1_BOD_EN_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) Disable  */
#define   AON_GP_REGS_RF_PMU_REGS_1_BOD_EN_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) Enable  */
#define AON_GP_REGS_RF_PMU_REGS_1_BOD_EN_0  (AON_GP_REGS_RF_PMU_REGS_1_BOD_EN_0_Val << AON_GP_REGS_RF_PMU_REGS_1_BOD_EN_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) Disable Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_BOD_EN_1  (AON_GP_REGS_RF_PMU_REGS_1_BOD_EN_1_Val << AON_GP_REGS_RF_PMU_REGS_1_BOD_EN_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) Enable Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_LPD_CLK_INJECT_EN_Pos 8                                              /**< (AON_GP_REGS_RF_PMU_REGS_1) Low Power Domain Clock Injection Enable Control Position */
#define AON_GP_REGS_RF_PMU_REGS_1_LPD_CLK_INJECT_EN_Msk (0x1u << AON_GP_REGS_RF_PMU_REGS_1_LPD_CLK_INJECT_EN_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) Low Power Domain Clock Injection Enable Control Mask */
#define AON_GP_REGS_RF_PMU_REGS_1_LPD_CLK_INJECT_EN AON_GP_REGS_RF_PMU_REGS_1_LPD_CLK_INJECT_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_RF_PMU_REGS_1_LPD_CLK_INJECT_EN_Msk instead */
#define   AON_GP_REGS_RF_PMU_REGS_1_LPD_CLK_INJECT_EN_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) Disable (Free running)  */
#define   AON_GP_REGS_RF_PMU_REGS_1_LPD_CLK_INJECT_EN_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) Enable (Lock to XO clock)  */
#define AON_GP_REGS_RF_PMU_REGS_1_LPD_CLK_INJECT_EN_0 (AON_GP_REGS_RF_PMU_REGS_1_LPD_CLK_INJECT_EN_0_Val << AON_GP_REGS_RF_PMU_REGS_1_LPD_CLK_INJECT_EN_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) Disable (Free running) Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_LPD_CLK_INJECT_EN_1 (AON_GP_REGS_RF_PMU_REGS_1_LPD_CLK_INJECT_EN_1_Val << AON_GP_REGS_RF_PMU_REGS_1_LPD_CLK_INJECT_EN_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) Enable (Lock to XO clock) Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_BYP_Pos 9                                              /**< (AON_GP_REGS_RF_PMU_REGS_1) Bypass controlf for EFUSE LDO Position */
#define AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_BYP_Msk (0x1u << AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_BYP_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) Bypass controlf for EFUSE LDO Mask */
#define AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_BYP AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_BYP_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_BYP_Msk instead */
#define   AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_BYP_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) EFUSE LDO regulates from VBATT voltage to 2.5V  */
#define   AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_BYP_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1)  EFUSE LDO is bypass to VBATT voltage  */
#define AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_BYP_0 (AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_BYP_0_Val << AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_BYP_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) EFUSE LDO regulates from VBATT voltage to 2.5V Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_BYP_1 (AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_BYP_1_Val << AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_BYP_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1)  EFUSE LDO is bypass to VBATT voltage Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_Pos 10                                             /**< (AON_GP_REGS_RF_PMU_REGS_1) Output voltage of EFUSE LDO Position */
#define AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_Msk (0x7u << AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) Output voltage of EFUSE LDO Mask */
#define AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL(value) (AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_Msk & ((value) << AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_Pos))
#define   AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 2.3V  */
#define   AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 2.4V  */
#define   AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_2_Val 0x2u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 2.4V  */
#define   AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_3_Val 0x3u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 2.5V  */
#define   AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_4_Val 0x4u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 2.6V  */
#define   AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_5_Val 0x5u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 2.7V  */
#define   AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_6_Val 0x6u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 2.7V  */
#define   AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_7_Val 0x7u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 2.8V  */
#define AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_0 (AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_0_Val << AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 2.3V Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_1 (AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_1_Val << AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 2.4V Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_2 (AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_2_Val << AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 2.4V Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_3 (AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_3_Val << AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 2.5V Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_4 (AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_4_Val << AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 2.6V Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_5 (AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_5_Val << AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 2.7V Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_6 (AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_6_Val << AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 2.7V Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_7 (AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_7_Val << AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 2.8V Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL_Pos 13                                             /**< (AON_GP_REGS_RF_PMU_REGS_1) Set the current bias for the EFUSE LDO Position */
#define AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL_Msk (0x3u << AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) Set the current bias for the EFUSE LDO Mask */
#define AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL(value) (AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL_Msk & ((value) << AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL_Pos))
#define   AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 80uA bias current  */
#define   AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 100uA bias current  */
#define   AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL_2_Val 0x2u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 120uA bias current  */
#define   AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL_3_Val 0x3u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 140uA bias current  */
#define AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL_0 (AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL_0_Val << AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 80uA bias current Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL_1 (AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL_1_Val << AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 100uA bias current Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL_2 (AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL_2_Val << AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 120uA bias current Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL_3 (AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL_3_Val << AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 140uA bias current Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_RES_CTRL_Pos 15                                             /**< (AON_GP_REGS_RF_PMU_REGS_1) RTC crystal circuit feedback resistance value Position */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_RES_CTRL_Msk (0x1u << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_RES_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) RTC crystal circuit feedback resistance value Mask */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_RES_CTRL AON_GP_REGS_RF_PMU_REGS_1_PIERCE_RES_CTRL_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_RF_PMU_REGS_1_PIERCE_RES_CTRL_Msk instead */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_RES_CTRL_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 20Mohm resistor  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_RES_CTRL_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 30Mohm resistor  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_RES_CTRL_0 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_RES_CTRL_0_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_RES_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 20Mohm resistor Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_RES_CTRL_1 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_RES_CTRL_1_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_RES_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 30Mohm resistor Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_Pos 16                                             /**< (AON_GP_REGS_RF_PMU_REGS_1) Transconductance of RTC oscillator Position */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_Msk (0xFu << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) Transconductance of RTC oscillator Mask */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL(value) (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_Msk & ((value) << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_Pos))
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 75nS  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 85nS  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_2_Val 0x2u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 96nS  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_3_Val 0x3u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 106nS  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_4_Val 0x4u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 116nS  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_5_Val 0x5u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 127nS  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_6_Val 0x6u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 137nS  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_7_Val 0x7u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 147nS  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_8_Val 0x8u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 158nS  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_9_Val 0x9u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 168nS  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_10_Val 0xAu                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 178nS  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_11_Val 0xBu                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 189nS  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_12_Val 0xCu                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 199nS  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_13_Val 0xDu                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 209nS  */
