remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/aon_gp_regs.h
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_14_Val 0xEu                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 220nS  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_15_Val 0xFu                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 230nS  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_0 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_0_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 75nS Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_1 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_1_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 85nS Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_2 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_2_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 96nS Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_3 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_3_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 106nS Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_4 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_4_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 116nS Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_5 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_5_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 127nS Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_6 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_6_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 137nS Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_7 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_7_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 147nS Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_8 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_8_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 158nS Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_9 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_9_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 168nS Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_10 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_10_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 178nS Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_11 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_11_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 189nS Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_12 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_12_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 199nS Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_13 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_13_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 209nS Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_14 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_14_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 220nS Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_15 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_15_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 230nS Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_Pos 20                                             /**< (AON_GP_REGS_RF_PMU_REGS_1) On chip single ended capacitors for RTC oscillator Position */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_Msk (0xFu << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) On chip single ended capacitors for RTC oscillator Mask */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL(value) (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_Msk & ((value) << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_Pos))
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 0pF  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 1pF  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_2_Val 0x2u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 2pF  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_3_Val 0x3u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 3pF  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_4_Val 0x4u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 4pF  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_5_Val 0x5u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 5pF  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_6_Val 0x6u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 6pF  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_7_Val 0x7u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 7pF  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_8_Val 0x8u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 8pF  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_9_Val 0x9u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 9pF  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_10_Val 0xAu                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 10pF  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_11_Val 0xBu                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 11pF  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_12_Val 0xCu                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 12pF  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_13_Val 0xDu                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 13pF  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_14_Val 0xEu                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 14pF  */
#define   AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_15_Val 0xFu                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) 15pF  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_0 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_0_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 0pF Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_1 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_1_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 1pF Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_2 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_2_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 2pF Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_3 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_3_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 3pF Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_4 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_4_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 4pF Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_5 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_5_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 5pF Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_6 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_6_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 6pF Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_7 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_7_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 7pF Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_8 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_8_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 8pF Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_9 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_9_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 9pF Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_10 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_10_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 10pF Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_11 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_11_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 11pF Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_12 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_12_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 12pF Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_13 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_13_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 13pF Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_14 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_14_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 14pF Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_15 (AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_15_Val << AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) 15pF Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_CTRL_Pos 24                                             /**< (AON_GP_REGS_RF_PMU_REGS_1) enable input channel time multiplexing to the sensor ADC Position */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_CTRL_Msk (0x1u << AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) enable input channel time multiplexing to the sensor ADC Mask */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_CTRL AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_CTRL_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_CTRL_Msk instead */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_CTRL_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) Conversion is done on the four input channels in a time multiplexed manner  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_CTRL_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) Conversion is done for one specific input channel  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_CTRL_0 (AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_CTRL_0_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) Conversion is done on the four input channels in a time multiplexed manner Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_CTRL_1 (AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_CTRL_1_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) Conversion is done for one specific input channel Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_Pos 25                                             /**< (AON_GP_REGS_RF_PMU_REGS_1) Input channel selection for the sensor ADC Position */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_Msk (0x7u << AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) Input channel selection for the sensor ADC Mask */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL(value) (AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_Msk & ((value) << AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_Pos))
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) GPIO_MS1  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) GPIO_MS2  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_2_Val 0x2u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) GPIO_MS3  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_3_Val 0x3u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) GPIO_MS4  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_4_Val 0x4u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) On Chip Temperature  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_5_Val 0x5u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) VBATT divided by 4 voltage level  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_6_Val 0x6u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) LP_LDO_OUT_1P2 low power domain voltage  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_7_Val 0x7u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) Sensor ADC reference voltage level  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_0 (AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_0_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) GPIO_MS1 Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_1 (AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_1_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) GPIO_MS2 Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_2 (AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_2_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) GPIO_MS3 Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_3 (AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_3_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) GPIO_MS4 Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_4 (AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_4_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) On Chip Temperature Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_5 (AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_5_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) VBATT divided by 4 voltage level Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_6 (AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_6_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) LP_LDO_OUT_1P2 low power domain voltage Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_7 (AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_7_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) Sensor ADC reference voltage level Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_CODE_IN_Pos 28                                             /**< (AON_GP_REGS_RF_PMU_REGS_1) Optional mode to improve sub-ranging technique of the sensor ADC Position */
#define AON_GP_REGS_RF_PMU_REGS_1_CODE_IN_Msk (0x3u << AON_GP_REGS_RF_PMU_REGS_1_CODE_IN_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) Optional mode to improve sub-ranging technique of the sensor ADC Mask */
#define AON_GP_REGS_RF_PMU_REGS_1_CODE_IN(value) (AON_GP_REGS_RF_PMU_REGS_1_CODE_IN_Msk & ((value) << AON_GP_REGS_RF_PMU_REGS_1_CODE_IN_Pos))
#define   AON_GP_REGS_RF_PMU_REGS_1_CODE_IN_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) input dynamic range from 0V to VBATT voltage level  */
#define   AON_GP_REGS_RF_PMU_REGS_1_CODE_IN_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) input dynamic range from 0.08*VBATT to 0.92*VBATT  */
#define   AON_GP_REGS_RF_PMU_REGS_1_CODE_IN_2_Val 0x2u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) input dynamic range from 0.17*VBATT to 0.83*VBATT  */
#define   AON_GP_REGS_RF_PMU_REGS_1_CODE_IN_3_Val 0x3u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) input dynamic range from 0.25*VBATT to 0.75*VBATT  */
#define AON_GP_REGS_RF_PMU_REGS_1_CODE_IN_0 (AON_GP_REGS_RF_PMU_REGS_1_CODE_IN_0_Val << AON_GP_REGS_RF_PMU_REGS_1_CODE_IN_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) input dynamic range from 0V to VBATT voltage level Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_CODE_IN_1 (AON_GP_REGS_RF_PMU_REGS_1_CODE_IN_1_Val << AON_GP_REGS_RF_PMU_REGS_1_CODE_IN_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) input dynamic range from 0.08*VBATT to 0.92*VBATT Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_CODE_IN_2 (AON_GP_REGS_RF_PMU_REGS_1_CODE_IN_2_Val << AON_GP_REGS_RF_PMU_REGS_1_CODE_IN_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) input dynamic range from 0.17*VBATT to 0.83*VBATT Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_CODE_IN_3 (AON_GP_REGS_RF_PMU_REGS_1_CODE_IN_3_Val << AON_GP_REGS_RF_PMU_REGS_1_CODE_IN_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) input dynamic range from 0.25*VBATT to 0.75*VBATT Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL_Pos 30                                             /**< (AON_GP_REGS_RF_PMU_REGS_1) Comparator biasing current for different sampling rates of the sensor ADC Position */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL_Msk (0x3u << AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) Comparator biasing current for different sampling rates of the sensor ADC Mask */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL(value) (AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL_Msk & ((value) << AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL_Pos))
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) Comparator bias current is 4uA  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) Comparator bias current is 8uA  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL_2_Val 0x2u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) Comparator bias current is 20uA  */
#define   AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL_3_Val 0x3u                                           /**< (AON_GP_REGS_RF_PMU_REGS_1) Comparator bias current is 24uA  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL_0 (AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL_0_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) Comparator bias current is 4uA Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL_1 (AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL_1_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) Comparator bias current is 8uA Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL_2 (AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL_2_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) Comparator bias current is 20uA Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL_3 (AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL_3_Val << AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_1) Comparator bias current is 24uA Position  */
#define AON_GP_REGS_RF_PMU_REGS_1_MASK      0xFFFFFFFFu                                    /**< \deprecated (AON_GP_REGS_RF_PMU_REGS_1) Register MASK  (Use AON_GP_REGS_RF_PMU_REGS_1_Msk instead)  */
#define AON_GP_REGS_RF_PMU_REGS_1_Msk       0xFFFFFFFFu                                    /**< (AON_GP_REGS_RF_PMU_REGS_1) Register Mask  */

/* -------- AON_GP_REGS_RF_PMU_REGS_2 : (AON_GP_REGS Offset: 0x408) (R/W 16) RF PMU Registers -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t DIG_CORE_LDO_BYP:1;        /**< bit:      0  Bypass mode of digital core LDO which regulates from the buck converter output to the local power domains of each digital power island */
    uint16_t DIG_CORE_LDO_VCTRL:2;      /**< bit:   1..2  Voltage level of the digital core LDO when LDO is not in bypass mode */
    uint16_t REF_HP_MODE:3;             /**< bit:   3..5  Controls the sensor ADCs internal reference buffer output resistance */
    uint16_t OFFSET_CAL_EN:1;           /**< bit:      6  Enable sensor ADC offset calibration     */
    uint16_t RESERVED_7:1;              /**< bit:      7  not using                                */
    uint16_t CLK_CTRL_26MHZ:5;          /**< bit:  8..12  Control the 26MHz RC oscillator frequency */
    uint16_t RESERVED_15_13:3;          /**< bit: 13..15  not using                                */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} AON_GP_REGS_RF_PMU_REGS_2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_GP_REGS_RF_PMU_REGS_2_OFFSET    0x408                                         /**<  (AON_GP_REGS_RF_PMU_REGS_2) RF PMU Registers  Offset */
#define AON_GP_REGS_RF_PMU_REGS_2_RESETVALUE 0x05u                                         /**<  (AON_GP_REGS_RF_PMU_REGS_2) RF PMU Registers  Reset Value */

