remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/aon_gp_regs.h
#define AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_BYP_Pos 0                                              /**< (AON_GP_REGS_RF_PMU_REGS_2) Bypass mode of digital core LDO which regulates from the buck converter output to the local power domains of each digital power island Position */
#define AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_BYP_Msk (0x1u << AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_BYP_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) Bypass mode of digital core LDO which regulates from the buck converter output to the local power domains of each digital power island Mask */
#define AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_BYP AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_BYP_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_BYP_Msk instead */
#define   AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_BYP_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) Not in bypass mode  */
#define   AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_BYP_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) Bypass mode so output will be shorted to the buck converter output  */
#define AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_BYP_0 (AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_BYP_0_Val << AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_BYP_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) Not in bypass mode Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_BYP_1 (AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_BYP_1_Val << AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_BYP_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) Bypass mode so output will be shorted to the buck converter output Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL_Pos 1                                              /**< (AON_GP_REGS_RF_PMU_REGS_2) Voltage level of the digital core LDO when LDO is not in bypass mode Position */
#define AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL_Msk (0x3u << AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) Voltage level of the digital core LDO when LDO is not in bypass mode Mask */
#define AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL(value) (AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL_Msk & ((value) << AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL_Pos))
#define   AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) 0.91V  */
#define   AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) 0.96V  */
#define   AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL_2_Val 0x2u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) 1.02V  */
#define   AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL_3_Val 0x3u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) 1.09V  */
#define AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL_0 (AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL_0_Val << AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 0.91V Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL_1 (AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL_1_Val << AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 0.96V Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL_2 (AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL_2_Val << AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 1.02V Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL_3 (AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL_3_Val << AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 1.09V Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_Pos 3                                              /**< (AON_GP_REGS_RF_PMU_REGS_2) Controls the sensor ADCs internal reference buffer output resistance Position */
#define AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_Msk (0x7u << AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) Controls the sensor ADCs internal reference buffer output resistance Mask */
#define AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE(value) (AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_Msk & ((value) << AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_Pos))
#define   AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) setting for applications that require less than 10KSPS  */
#define   AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) setting for throughputs between 10KSPS and 100KSPS  */
#define   AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_2_Val 0x2u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) setting for 100KSPS  */
#define   AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_3_Val 0x3u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) setting for 325KSPS  */
#define   AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_4_Val 0x4u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) setting for 550KSPS  */
#define   AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_5_Val 0x5u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) setting for 775KSPS  */
#define   AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_6_Val 0x6u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) setting for 1MSPS  */
#define AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_0 (AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_0_Val << AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) setting for applications that require less than 10KSPS Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_1 (AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_1_Val << AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) setting for throughputs between 10KSPS and 100KSPS Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_2 (AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_2_Val << AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) setting for 100KSPS Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_3 (AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_3_Val << AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) setting for 325KSPS Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_4 (AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_4_Val << AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) setting for 550KSPS Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_5 (AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_5_Val << AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) setting for 775KSPS Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_6 (AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_6_Val << AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) setting for 1MSPS Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_OFFSET_CAL_EN_Pos 6                                              /**< (AON_GP_REGS_RF_PMU_REGS_2) Enable sensor ADC offset calibration Position */
#define AON_GP_REGS_RF_PMU_REGS_2_OFFSET_CAL_EN_Msk (0x1u << AON_GP_REGS_RF_PMU_REGS_2_OFFSET_CAL_EN_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) Enable sensor ADC offset calibration Mask */
#define AON_GP_REGS_RF_PMU_REGS_2_OFFSET_CAL_EN AON_GP_REGS_RF_PMU_REGS_2_OFFSET_CAL_EN_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_RF_PMU_REGS_2_OFFSET_CAL_EN_Msk instead */
#define   AON_GP_REGS_RF_PMU_REGS_2_OFFSET_CAL_EN_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) Disable  */
#define   AON_GP_REGS_RF_PMU_REGS_2_OFFSET_CAL_EN_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) Enable  */
#define AON_GP_REGS_RF_PMU_REGS_2_OFFSET_CAL_EN_0 (AON_GP_REGS_RF_PMU_REGS_2_OFFSET_CAL_EN_0_Val << AON_GP_REGS_RF_PMU_REGS_2_OFFSET_CAL_EN_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) Disable Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_OFFSET_CAL_EN_1 (AON_GP_REGS_RF_PMU_REGS_2_OFFSET_CAL_EN_1_Val << AON_GP_REGS_RF_PMU_REGS_2_OFFSET_CAL_EN_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) Enable Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_RESERVED_7_Pos 7                                              /**< (AON_GP_REGS_RF_PMU_REGS_2) not using Position */
#define AON_GP_REGS_RF_PMU_REGS_2_RESERVED_7_Msk (0x1u << AON_GP_REGS_RF_PMU_REGS_2_RESERVED_7_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) not using Mask */
#define AON_GP_REGS_RF_PMU_REGS_2_RESERVED_7 AON_GP_REGS_RF_PMU_REGS_2_RESERVED_7_Msk       /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_RF_PMU_REGS_2_RESERVED_7_Msk instead */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos 8                                              /**< (AON_GP_REGS_RF_PMU_REGS_2) Control the 26MHz RC oscillator frequency Position */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Msk (0x1Fu << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) Control the 26MHz RC oscillator frequency Mask */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ(value) (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Msk & ((value) << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos))
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_0_Val 0x0u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) 12MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_1_Val 0x1u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) 13MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_2_Val 0x2u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) 14MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_3_Val 0x3u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) 15MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_4_Val 0x4u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) 16MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_5_Val 0x5u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) 17MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_6_Val 0x6u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) 18MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_7_Val 0x7u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) 19MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_8_Val 0x8u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) 20MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_9_Val 0x9u                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) 21MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_10_Val 0xAu                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) 22MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_11_Val 0xBu                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) 23MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_12_Val 0xCu                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) 24MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_13_Val 0xDu                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) 25MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_14_Val 0xEu                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) 26MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_15_Val 0xFu                                           /**< (AON_GP_REGS_RF_PMU_REGS_2) 27MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_16_Val 0x10u                                          /**< (AON_GP_REGS_RF_PMU_REGS_2) 28MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_17_Val 0x11u                                          /**< (AON_GP_REGS_RF_PMU_REGS_2) 29MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_18_Val 0x12u                                          /**< (AON_GP_REGS_RF_PMU_REGS_2) 30MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_19_Val 0x13u                                          /**< (AON_GP_REGS_RF_PMU_REGS_2) 31MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_20_Val 0x14u                                          /**< (AON_GP_REGS_RF_PMU_REGS_2) 32MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_21_Val 0x15u                                          /**< (AON_GP_REGS_RF_PMU_REGS_2) 33MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_22_Val 0x16u                                          /**< (AON_GP_REGS_RF_PMU_REGS_2) 34MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_23_Val 0x17u                                          /**< (AON_GP_REGS_RF_PMU_REGS_2) 35MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_24_Val 0x18u                                          /**< (AON_GP_REGS_RF_PMU_REGS_2) 36MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_25_Val 0x19u                                          /**< (AON_GP_REGS_RF_PMU_REGS_2) 37MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_26_Val 0x1Au                                          /**< (AON_GP_REGS_RF_PMU_REGS_2) 38MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_27_Val 0x1Bu                                          /**< (AON_GP_REGS_RF_PMU_REGS_2) 39MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_28_Val 0x1Cu                                          /**< (AON_GP_REGS_RF_PMU_REGS_2) 40MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_29_Val 0x1Du                                          /**< (AON_GP_REGS_RF_PMU_REGS_2) 41MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_30_Val 0x1Eu                                          /**< (AON_GP_REGS_RF_PMU_REGS_2) 42MHz  */
#define   AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_31_Val 0x1Fu                                          /**< (AON_GP_REGS_RF_PMU_REGS_2) 43MHz  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_0 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_0_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 12MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_1 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_1_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 13MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_2 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_2_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 14MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_3 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_3_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 15MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_4 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_4_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 16MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_5 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_5_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 17MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_6 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_6_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 18MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_7 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_7_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 19MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_8 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_8_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 20MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_9 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_9_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 21MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_10 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_10_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 22MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_11 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_11_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 23MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_12 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_12_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 24MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_13 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_13_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 25MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_14 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_14_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 26MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_15 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_15_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 27MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_16 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_16_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 28MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_17 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_17_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 29MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_18 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_18_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 30MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_19 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_19_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 31MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_20 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_20_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 32MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_21 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_21_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 33MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_22 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_22_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 34MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_23 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_23_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 35MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_24 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_24_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 36MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_25 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_25_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 37MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_26 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_26_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 38MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_27 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_27_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 39MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_28 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_28_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 40MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_29 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_29_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 41MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_30 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_30_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 42MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_31 (AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_31_Val << AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) 43MHz Position  */
#define AON_GP_REGS_RF_PMU_REGS_2_RESERVED_15_13_Pos 13                                             /**< (AON_GP_REGS_RF_PMU_REGS_2) not using Position */
#define AON_GP_REGS_RF_PMU_REGS_2_RESERVED_15_13_Msk (0x7u << AON_GP_REGS_RF_PMU_REGS_2_RESERVED_15_13_Pos)  /**< (AON_GP_REGS_RF_PMU_REGS_2) not using Mask */
#define AON_GP_REGS_RF_PMU_REGS_2_RESERVED_15_13(value) (AON_GP_REGS_RF_PMU_REGS_2_RESERVED_15_13_Msk & ((value) << AON_GP_REGS_RF_PMU_REGS_2_RESERVED_15_13_Pos))
#define AON_GP_REGS_RF_PMU_REGS_2_MASK      0xFFFFu                                        /**< \deprecated (AON_GP_REGS_RF_PMU_REGS_2) Register MASK  (Use AON_GP_REGS_RF_PMU_REGS_2_Msk instead)  */
#define AON_GP_REGS_RF_PMU_REGS_2_Msk       0xFFFFu                                        /**< (AON_GP_REGS_RF_PMU_REGS_2) Register Mask  */

