remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/aon_gp_regs.h
/* -------- AON_GP_REGS_MS_GPIO_MODE : (AON_GP_REGS Offset: 0x410) (R/W 8) Analog Mode Select of Mixed Signal GPIOs -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  ANALOG_ENABLE_44:1;        /**< bit:      0  Active High Analog Mode Enable for Mixed Signal LP_GPIO_44 */
    uint8_t  ANALOG_ENABLE_45:1;        /**< bit:      1  Active High Analog Mode Enable for Mixed Signal LP_GPIO_45 */
    uint8_t  ANALOG_ENABLE_46:1;        /**< bit:      2  Active High Analog Mode Enable for Mixed Signal LP_GPIO_46 */
    uint8_t  ANALOG_ENABLE_47:1;        /**< bit:      3  Active High Analog Mode Enable for Mixed Signal LP_GPIO_47 */
    uint8_t  :4;                        /**< bit:   4..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint8_t  ANALOG_ENABLE_:4;          /**< bit:   0..3  Active High Analog Mode Enable for Mixed Signal LP_GPIO_47 */
    uint8_t  :4;                        /**< bit:   4..7 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint8_t  reg;                         /**< Type used for register access */
} AON_GP_REGS_MS_GPIO_MODE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_GP_REGS_MS_GPIO_MODE_OFFSET     0x410                                         /**<  (AON_GP_REGS_MS_GPIO_MODE) Analog Mode Select of Mixed Signal GPIOs  Offset */
#define AON_GP_REGS_MS_GPIO_MODE_RESETVALUE 0x0Fu                                         /**<  (AON_GP_REGS_MS_GPIO_MODE) Analog Mode Select of Mixed Signal GPIOs  Reset Value */

#define AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_44_Pos 0                                              /**< (AON_GP_REGS_MS_GPIO_MODE) Active High Analog Mode Enable for Mixed Signal LP_GPIO_44 Position */
#define AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_44_Msk (0x1u << AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_44_Pos)  /**< (AON_GP_REGS_MS_GPIO_MODE) Active High Analog Mode Enable for Mixed Signal LP_GPIO_44 Mask */
#define AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_44 AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_44_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_44_Msk instead */
#define AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_45_Pos 1                                              /**< (AON_GP_REGS_MS_GPIO_MODE) Active High Analog Mode Enable for Mixed Signal LP_GPIO_45 Position */
#define AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_45_Msk (0x1u << AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_45_Pos)  /**< (AON_GP_REGS_MS_GPIO_MODE) Active High Analog Mode Enable for Mixed Signal LP_GPIO_45 Mask */
#define AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_45 AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_45_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_45_Msk instead */
#define AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_46_Pos 2                                              /**< (AON_GP_REGS_MS_GPIO_MODE) Active High Analog Mode Enable for Mixed Signal LP_GPIO_46 Position */
#define AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_46_Msk (0x1u << AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_46_Pos)  /**< (AON_GP_REGS_MS_GPIO_MODE) Active High Analog Mode Enable for Mixed Signal LP_GPIO_46 Mask */
#define AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_46 AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_46_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_46_Msk instead */
#define AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_47_Pos 3                                              /**< (AON_GP_REGS_MS_GPIO_MODE) Active High Analog Mode Enable for Mixed Signal LP_GPIO_47 Position */
#define AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_47_Msk (0x1u << AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_47_Pos)  /**< (AON_GP_REGS_MS_GPIO_MODE) Active High Analog Mode Enable for Mixed Signal LP_GPIO_47 Mask */
#define AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_47 AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_47_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_47_Msk instead */
#define AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE__Pos 0                                              /**< (AON_GP_REGS_MS_GPIO_MODE Position) Active High Analog Mode Enable for Mixed Signal LP_GPIO_47 */
#define AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE__Msk (0xFu << AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE__Pos)  /**< (AON_GP_REGS_MS_GPIO_MODE Mask) ANALOG_ENABLE_ */
#define AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE_(value) (AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE__Msk & ((value) << AON_GP_REGS_MS_GPIO_MODE_ANALOG_ENABLE__Pos))  
#define AON_GP_REGS_MS_GPIO_MODE_MASK       0x0Fu                                          /**< \deprecated (AON_GP_REGS_MS_GPIO_MODE) Register MASK  (Use AON_GP_REGS_MS_GPIO_MODE_Msk instead)  */
#define AON_GP_REGS_MS_GPIO_MODE_Msk        0x0Fu                                          /**< (AON_GP_REGS_MS_GPIO_MODE) Register Mask  */

/* -------- AON_GP_REGS_IO_PADS_CONTROL : (AON_GP_REGS Offset: 0x414) (R/W 8) Controls behaviour of IO Pads in Sleep Mode -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  LATCH_ENABLE:1;            /**< bit:      0  Active High Latch Enable of IO Pads configuration parameters. When Low, Pads retain their configured state during sleep mode. */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} AON_GP_REGS_IO_PADS_CONTROL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_GP_REGS_IO_PADS_CONTROL_OFFSET  0x414                                         /**<  (AON_GP_REGS_IO_PADS_CONTROL) Controls behaviour of IO Pads in Sleep Mode  Offset */
#define AON_GP_REGS_IO_PADS_CONTROL_RESETVALUE 0x01u                                         /**<  (AON_GP_REGS_IO_PADS_CONTROL) Controls behaviour of IO Pads in Sleep Mode  Reset Value */

#define AON_GP_REGS_IO_PADS_CONTROL_LATCH_ENABLE_Pos 0                                              /**< (AON_GP_REGS_IO_PADS_CONTROL) Active High Latch Enable of IO Pads configuration parameters. When Low, Pads retain their configured state during sleep mode. Position */
#define AON_GP_REGS_IO_PADS_CONTROL_LATCH_ENABLE_Msk (0x1u << AON_GP_REGS_IO_PADS_CONTROL_LATCH_ENABLE_Pos)  /**< (AON_GP_REGS_IO_PADS_CONTROL) Active High Latch Enable of IO Pads configuration parameters. When Low, Pads retain their configured state during sleep mode. Mask */
#define AON_GP_REGS_IO_PADS_CONTROL_LATCH_ENABLE AON_GP_REGS_IO_PADS_CONTROL_LATCH_ENABLE_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_GP_REGS_IO_PADS_CONTROL_LATCH_ENABLE_Msk instead */
#define AON_GP_REGS_IO_PADS_CONTROL_MASK    0x01u                                          /**< \deprecated (AON_GP_REGS_IO_PADS_CONTROL) Register MASK  (Use AON_GP_REGS_IO_PADS_CONTROL_Msk instead)  */
#define AON_GP_REGS_IO_PADS_CONTROL_Msk     0x01u                                          /**< (AON_GP_REGS_IO_PADS_CONTROL) Register Mask  */

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief AON_GP_REGS hardware registers */
typedef struct {  /* Always On General Purpose Registers */
  RwReg16 AON_PINMUX_SEL; /**< (AON_GP_REGS Offset: 0x00) Controls the pinmux selection for the AO GPIOs */
  __I  uint8_t  Reserved1[2];
  RwReg   AON_PMU_CTRL;   /**< (AON_GP_REGS Offset: 0x04) Always On Misc Control */
  RwReg8  AON_BLE_LP_CTRL; /**< (AON_GP_REGS Offset: 0x08) Always On BLE LP Control */
  __I  uint8_t  Reserved2[3];
  RwReg   AON_MISC_CTRL;  /**< (AON_GP_REGS Offset: 0x0C) Always On Misc Control */
  RwReg8  AON_GLOBAL_RESET; /**< (AON_GP_REGS Offset: 0x10) Active Low Always On Reset Control */
  __I  uint8_t  Reserved3[3];
  RwReg8  AON_PULL_ENABLE; /**< (AON_GP_REGS Offset: 0x14) Active Low Always On Pull Enable Control */
  __I  uint8_t  Reserved4[7];
  RwReg   AON_RESET_CTRL; /**< (AON_GP_REGS Offset: 0x1C) Reset Count Control for PD1, PD4, PD6 and PD7 */
  RwReg8  AON_BTRIM_ACTIVE; /**< (AON_GP_REGS Offset: 0x20) BTRIM settings for active mode (i.e. not in retention) */
  __I  uint8_t  Reserved5[3];
  RwReg8  AON_BTRIM_RETENTION; /**< (AON_GP_REGS Offset: 0x24) BTRIM settings for retention mode */
  __I  uint8_t  Reserved6[27];
  RwReg8  AON_LPMCU_SCRATCH_PAD; /**< (AON_GP_REGS Offset: 0x40) Usage for the LPMCU for any sort of status it needs to store for itself before it goes to sleep */
  __I  uint8_t  Reserved7[3];
  RwReg8  AON_LPMCU_COLD_BOOT; /**< (AON_GP_REGS Offset: 0x44) To be used by ARM to determine if it is a cold boot or not */
  __I  uint8_t  Reserved8[59];
  RoReg8  AON_BO_OUT_STATUS; /**< (AON_GP_REGS Offset: 0x80) Brown Out Detected (must be cleared manually) */
  __I  uint8_t  Reserved9[3];
  RwReg8  CLEAR_BROWN_OUT_REG; /**< (AON_GP_REGS Offset: 0x84) Set to 1 to clear (hold until 0 read at aon_bo_out_status and then this must be cleared to detect another brown out condition) */
  __I  uint8_t  Reserved10[891];
  RwReg   RF_PMU_REGS_0;  /**< (AON_GP_REGS Offset: 0x400) RF PMU Registers */
  RwReg   RF_PMU_REGS_1;  /**< (AON_GP_REGS Offset: 0x404) RF PMU Registers */
  RwReg16 RF_PMU_REGS_2;  /**< (AON_GP_REGS Offset: 0x408) RF PMU Registers */
  __I  uint8_t  Reserved11[6];
  RwReg8  MS_GPIO_MODE;   /**< (AON_GP_REGS Offset: 0x410) Analog Mode Select of Mixed Signal GPIOs */
  __I  uint8_t  Reserved12[3];
  RwReg8  IO_PADS_CONTROL; /**< (AON_GP_REGS Offset: 0x414) Controls behaviour of IO Pads in Sleep Mode */
} AonGpRegs;

