remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/aon_gp_regs.h
#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief AON_GP_REGS hardware registers */
typedef struct {  /* Always On General Purpose Registers */
  __IO AON_GP_REGS_AON_PINMUX_SEL_Type AON_PINMUX_SEL; /**< Offset: 0x00 (R/W  16) Controls the pinmux selection for the AO GPIOs */
       RoReg8                         Reserved1[0x2];
  __IO AON_GP_REGS_AON_PMU_CTRL_Type  AON_PMU_CTRL;   /**< Offset: 0x04 (R/W  32) Always On Misc Control */
  __IO AON_GP_REGS_AON_BLE_LP_CTRL_Type AON_BLE_LP_CTRL; /**< Offset: 0x08 (R/W   8) Always On BLE LP Control */
       RoReg8                         Reserved2[0x3];
  __IO AON_GP_REGS_AON_MISC_CTRL_Type AON_MISC_CTRL;  /**< Offset: 0x0C (R/W  32) Always On Misc Control */
  __IO AON_GP_REGS_AON_GLOBAL_RESET_Type AON_GLOBAL_RESET; /**< Offset: 0x10 (R/W   8) Active Low Always On Reset Control */
       RoReg8                         Reserved3[0x3];
  __IO AON_GP_REGS_AON_PULL_ENABLE_Type AON_PULL_ENABLE; /**< Offset: 0x14 (R/W   8) Active Low Always On Pull Enable Control */
       RoReg8                         Reserved4[0x7];
  __IO AON_GP_REGS_AON_RESET_CTRL_Type AON_RESET_CTRL; /**< Offset: 0x1C (R/W  32) Reset Count Control for PD1, PD4, PD6 and PD7 */
  __IO AON_GP_REGS_AON_BTRIM_ACTIVE_Type AON_BTRIM_ACTIVE; /**< Offset: 0x20 (R/W   8) BTRIM settings for active mode (i.e. not in retention) */
       RoReg8                         Reserved5[0x3];
  __IO AON_GP_REGS_AON_BTRIM_RETENTION_Type AON_BTRIM_RETENTION; /**< Offset: 0x24 (R/W   8) BTRIM settings for retention mode */
       RoReg8                         Reserved6[0x1B];
  __IO AON_GP_REGS_AON_LPMCU_SCRATCH_PAD_Type AON_LPMCU_SCRATCH_PAD; /**< Offset: 0x40 (R/W   8) Usage for the LPMCU for any sort of status it needs to store for itself before it goes to sleep */
       RoReg8                         Reserved7[0x3];
  __IO AON_GP_REGS_AON_LPMCU_COLD_BOOT_Type AON_LPMCU_COLD_BOOT; /**< Offset: 0x44 (R/W   8) To be used by ARM to determine if it is a cold boot or not */
       RoReg8                         Reserved8[0x3B];
  __I  AON_GP_REGS_AON_BO_OUT_STATUS_Type AON_BO_OUT_STATUS; /**< Offset: 0x80 (R/    8) Brown Out Detected (must be cleared manually) */
       RoReg8                         Reserved9[0x3];
  __IO AON_GP_REGS_CLEAR_BROWN_OUT_REG_Type CLEAR_BROWN_OUT_REG; /**< Offset: 0x84 (R/W   8) Set to 1 to clear (hold until 0 read at aon_bo_out_status and then this must be cleared to detect another brown out condition) */
       RoReg8                         Reserved10[0x37B];
  __IO AON_GP_REGS_RF_PMU_REGS_0_Type RF_PMU_REGS_0;  /**< Offset: 0x400 (R/W  32) RF PMU Registers */
  __IO AON_GP_REGS_RF_PMU_REGS_1_Type RF_PMU_REGS_1;  /**< Offset: 0x404 (R/W  32) RF PMU Registers */
  __IO AON_GP_REGS_RF_PMU_REGS_2_Type RF_PMU_REGS_2;  /**< Offset: 0x408 (R/W  16) RF PMU Registers */
       RoReg8                         Reserved11[0x6];
  __IO AON_GP_REGS_MS_GPIO_MODE_Type  MS_GPIO_MODE;   /**< Offset: 0x410 (R/W   8) Analog Mode Select of Mixed Signal GPIOs */
       RoReg8                         Reserved12[0x3];
  __IO AON_GP_REGS_IO_PADS_CONTROL_Type IO_PADS_CONTROL; /**< Offset: 0x414 (R/W   8) Controls behaviour of IO Pads in Sleep Mode */
} AonGpRegs;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** @}*/


#endif /* _SAMB11_AON_GP_REGS_COMPONENT_ */
